{
    "Pisces-INTJ": "Ini orang tuh mikirnya deep banget, kayak penyelam yang nyari harta karun di dasar laut. Tapi kenyataannya, mereka malah sering nyasar di labirin pikiran sendiri. Kombinasi dreamy Pisces sama rencana besar INTJ bikin mereka kadang mikirnya jauh ke depan, tapi realitanya mereka masih stuck di masa lalu. Sering keliatan sok cool padahal cuma takut dibilang bego.",
    "Pisces-INTP": "Kombinasi ini tuh kayak kucing liar yang pura-pura cuek tapi hatinya rapuh. Suka overthinking sampe kebanyakan teori konspirasi di kepala, tapi pas disuruh praktek malah mewek karena gak sesuai ekspektasi. Terlalu mikirin 'What if?' sampe lupa buat ngejalanin hidup beneran. Ngomongnya suka random kayak ada coding error di otak.",
    "Pisces-INFJ": "Ini tuh tipe orang yang kalo galau bisa bikin novel 10 bab. Suka mikirin semua orang tapi diri sendiri diabaikan. Kombinasi antara sok misterius INFJ dan baperan Pisces bikin mereka kayak tokoh utama drama Korea yang nyimpen rahasia besar padahal masalahnya cuma gara-gara salah chat.",
    "Pisces-INFP": "Si tukang ngelamun yang hatinya lembut kayak es krim tapi rapuh kayak wafer. Setiap liat daun jatuh bisa langsung keinget mantan. Hidupnya kayak playlist galau Spotify. Mereka tuh kayak mau jadi seniman keren, tapi seringnya malah cuma nulis puisi di notes HP yang ga bakal dibaca orang.",
    "Pisces-ENTJ": "Nah ini unik, orang yang pengen banget jadi boss tapi hatinya sensitif kayak gelembung sabun. Sok tegas di luar, dalem hati pengen dimanja. Suka ngomelin orang tapi diem-diem nangis di kamar kalo orangnya bales ngatain. Ambisius, tapi baper kalo kena kritik.",
    "Pisces-ENTP": "Kombinasi chaos. Sok lucu, sok nyeleneh, tapi pas sendirian galau mikirin kenapa dia dilahirin sebagai Pisces. Sering bikin jokes sarkas yang orang lain bingung ini serius apa bercanda. Hatinya tuh rapuh, tapi dia nutupin pake becandaan receh.",
    "Pisces-ENFJ": "Si penyayang yang pengen semua orang bahagia, tapi lupa kalo dirinya sendiri juga butuh bahagia. Suka ngurusin orang lain sampe lupa diri sendiri tuh kayak botol parfum yang disemprot terus tapi isinya ga pernah diisi ulang. Kalo ditolak malah bikin puisi panjang kayak lagi bikin script FTV.",
    "Pisces-ENFP": "Ini mah kombinasi antara tukang overthink sama social butterfly. Sok heboh di luar, padahal dalem hati sering insecure sampe pengen kabur dari dunia. Punya mimpi gede banget, tapi kadang lupa buat action. Suka ngomong 'I’m fine' padahal hatinya kayak es krim cair di siang bolong.",
    "Pisces-ISTJ": "Bayangin orang yang pengen banget hidup teratur, tapi otaknya Pisces yang random bikin mereka kayak printer yang paper jam terus. Suka bikin to-do list yang panjang, tapi akhirnya malah mager ngerjain. Kaku kayak papan, tapi hatinya lembut kayak jelly.",
    "Pisces-ISFJ": "Si pengabdi yang kadang terlalu baik sampe jadi korban. Suka diem-diem nahan sakit hati biar orang lain seneng. Keliatan tenang tapi dalemnya kayak tumpukan cucian yang belum diberesin. Suka bilang 'gapapa' padahal lagi nangis sambil nonton drama Korea.",
    "Pisces-ISFP": "Kombinasi seniman rapuh. Suka bikin aesthetic tapi hidupnya berantakan. Sering bilang 'gue butuh healing' padahal masalahnya cuma lupa beli pulsa. Suka bilang pengen bebas tapi malah baper kalo diabaikan. Mood swing-nya kayak rollercoaster.",
    "Pisces-ISTP": "Sok cool banget, kayak ninja yang jalan-jalan di mall. Tapi dalem hati gampang baper. Sering ngilang dari keramaian terus muncul lagi kayak ga ada apa-apa. Suka main logika, tapi pas dia yang kena masalah malah drama kayak sinetron.",
    "Pisces-ESFP": "Si tukang party yang hatinya kayak kapas. Seneng heboh, tapi kalo malem tiba-tiba galau mikirin ex. Hidupnya kayak instastory penuh filter, tapi pas ketemu langsung kayak 'kok lo diem?'. Suka drama sendiri terus upload story lagu galau.",
    "Pisces-ESTP": "Tipe yang berani bilang 'YOLO' tapi langsung galau kalo ditinggal. Sok rebel, sok seru, tapi pas ditinggal gebetan nangisnya diem-diem sambil nonton video lucu biar lupa. Ngomongnya sok tegas, padahal sebenernya bingung juga hidupnya.",
    "Pisces-ESFJ": "Si tukang ngurusin yang kadang pengen banget semua orang seneng. Sering terlalu baik sampe dimanfaatin. Keliatannya rame, padahal di rumah sering nangis kalo ngerasa ga dihargai. Suka bikin story pamer kue bikinan sendiri tapi endingnya galau.",
    "Pisces-ESTJ": "Kombinasi yang kayak bossy tapi baperan. Ngomongnya tegas kayak komandan, tapi kalo dikritik langsung diem sambil mikir 'emang aku seburuk itu ya?'. Suka mikir hidup tuh harus rapi, tapi pas gagal langsung drama seolah dunia kiamat."
}
