  {
"Pisces-INTJ":"Pisces-INTJ itu kayak otak brilian yang nyasar di dunianya sendiri. Dia punya rencana besar dan visi jauh ke depan, tapi suka keteteran ngejalanin hal-hal simpel sehari-hari. Sering ngumpet di balik tembok dingin sok tenang, padahal otaknya ribet kayak detektif yang kebanyakan teori tanpa bukti. Sok rasional, tapi ujung-ujungnya baper juga.",
"Pisces-INTP":"Pisces-INTP itu otak paling nyeleneh dan random, suka overanalis tapi sering stuck di ide doang. Ngomongnya suka tiba-tiba lompat topik kayak lagu remix kacau. Overthinking tingkat dewa bikin dia kebanyakan mikir ‘what if’ sampe lupa kerjain tugas nyata. Pas disuruh action? Langsung freeze kayak laptop nge-hang.",
"Pisces-INFJ":"Pisces-INFJ itu master drama sejati. Bisa bikin konflik dalem kepala jadi lebih ribet dari sinetron. Sok misterius dan peka banget sama orang, tapi kadang kelewat baper sampai stres sendiri gara-gara salah chat atau kata-kata minor. Hatinya ibarat labirin rahasia, yang nyasar bisa susah keluar.",
"Pisces-INFP":"Pisces-INFP itu penyair galau yang setiap detik kayak adegan slow motion. Ngelamun dan kebawa perasaan sama hal-hal kecil sampai susah fokus. Suka bilang “aku beda,” tapi seringnya malah tenggelam dalam dunia imajinasi tanpa action nyata. Selalu sibuk bikin puisi tapi ujung-ujungnya cuma jadi draft yang nggak kelar-kelar.",
"Pisces-ENTJ":"Pisces-ENTJ itu bos tegas yang kadang lupa kalau dia juga manusia. Sok kuat dan penuh kontrol, tapi hati gampang pecah dan baperan kalau ada kritik pedas. Pengen jadi pemimpin keren tapi sering kelihatan overacting kayak drama queen di meeting. Kalau disindir, reaksinya meledak-ledak tapi diam-diam mikir “kenapa aku gak cukup baik?”",
"Pisces-ENTP":"Pisces-ENTP itu chaos incarnate, ide-ide liar tapi gak konsisten. Suka debat, ngerjain banyak hal sekaligus, tapi jarang ada yang selesai. Sok jago ngelawak tapi sering bikin bingung orang karena jokes-nya terlalu random. Pas sendirian? Galau berat soal makna hidup dan kenapa dirinya harus jadi Pisces yang baper.",
"Pisces-ENFJ":"Pisces-ENFJ itu penyelamat dunia yang sering lupa selamatin dirinya sendiri. Terlalu sibuk ngurusin orang lain sampai kelelahan dan burnout, tapi gak mau ngaku. Punya hati selembut kapas tapi pamer kuat. Kalau ada yang ngelarang bantuin, bisa galau berhari-hari, nulis puisi sedih yang cuma dia yang baca.",
"Pisces-ENFP":"Pisces-ENFP itu social butterfly yang penuh energi tapi dalemnya sering insecure banget. Suka cari perhatian dan bikin heboh, tapi gampang down kalau gak dapet respons yang diharapkan. Mimpi dan ide besar, tapi gampang ketipu sama diri sendiri. Sering bilang “aku baik-baik saja” padahal kayak es krim meleleh di terik matahari.",
"Pisces-ISTJ":"Pisces-ISTJ itu detail freak yang pengen semuanya rapi tapi otaknya Pisces bikin semuanya kacau. Bikin to-do list segunung, tapi ujungnya banyak yang nganggur. Sok disiplin tapi gampang kebawa perasaan kalau ada yang gak sesuai rencana. Kaku dan serius, tapi hati lembut yang cuma bisa dia sembunyiin dengan rapi.",
"Pisces-ISFJ":"Pisces-ISFJ itu pengabdi setia yang diam-diam nahan sakit hati supaya orang lain senang. Suka ngalah dan sering dimanfaatin, tapi jarang protes. Keliatan tenang dan sabar, tapi kalau terlalu banyak beban, bisa meledak tiba-tiba kayak bom waktu. Bilang “gapapa” tapi sebenarnya hati sedang hancur berantakan.",
"Pisces-ISFP":"Pisces-ISFP itu seniman hati yang hidupnya penuh warna dan drama kecil. Suka cari aesthetic tapi kadang mood swing-nya kayak rollercoaster tanpa rem. Ingin bebas tapi takut ditinggal, gampang baper kalau diabaikan. Sering bilang butuh healing tapi gak konsisten jalani prosesnya, malah ngulang pola lama terus.",
"Pisces-ISTP":"Pisces-ISTP itu si dingin dan misterius yang kelihatan cool banget, tapi gampang baper. Suka ngilang tanpa kabar, datang lagi kayak gak ada apa-apa. Pakai logika tajam buat orang lain tapi pas kena masalah sendiri langsung drama. Sok mandiri tapi dalam hati pengen dimanja dan dimengerti.",
"Pisces-ESFP":"Pisces-ESFP itu party animal yang hatinya sensitif kayak kapas. Seneng heboh dan rame, tapi kalau malem tiba-tiba galau mikirin mantan. Hidupnya kayak instastory penuh filter, tapi kalau ketemu langsung sunyi dan awkward. Suka drama sendiri lalu upload lagu galau yang bikin followers ikut bingung.",
"Pisces-ESTP":"Pisces-ESTP itu rebel yang pede dan berani, tapi galau banget kalau ditinggal gebetan. Sok tegas dan lantang ngomong, tapi sebenarnya bingung mau kemana hidupnya. Hobi ambil risiko, tapi pas susah langsung nangis diem-diem sambil nonton video lucu.",
"Pisces-ESFJ":"Pisces-ESFJ itu tukang ngurus yang selalu pengen semua orang senang, tapi sering dimanfaatin. Keliatan ceria dan ramah di luar, tapi di rumah sering nangis diam-diam. Punya hati besar tapi gak selalu bisa bilang “tidak.” Suka pamer hal-hal kecil, tapi ujung-ujungnya galau sendiri.",
"Pisces-ESTJ":"Pisces-ESTJ itu bossy dan tegas, tapi gampang baper. Ngomongnya tegas kayak komandan, tapi kalo dikritik langsung diem sambil mikir ‘emang aku seburuk itu ya?’. Suka mikir hidup tuh harus rapi, tapi pas gagal langsung drama seolah dunia kiamat.",
    
  "Aquarius-INTJ": "Aquarius-INTJ itu ilmuwan eksentrik yang otaknya selalu di awang-awang, jauh banget dari realita. Punya ide revolusioner, tapi sering lupa makan dan mandi karena terlalu sibuk mikirin masa depan. Sok dingin dan analitis, tapi ujung-ujungnya ngedumel sendiri karena rencana rumitnya gak jalan sesuai ekspektasi. Kayak alien yang tersesat di dunia manusia.",
  "Aquarius-INTP": "Aquarius-INTP itu kutu buku yang otaknya kayak labirin rumit penuh teori aneh. Suka debat sampai lawan ngomong kayak lawan robot, tapi pas disuruh keluar dari zona nyaman malah ngilang kayak hantu. Ide-idenya cemerlang tapi susah dieksekusi karena sibuk mikir kemungkinan terburuk. Ngomongnya random, kadang bikin bingung bahkan diri sendiri.",
  "Aquarius-INFJ": "Aquarius-INFJ itu jenius misterius yang suka overthink sampai stres. Dia pinter banget baca situasi tapi sering salah paham karena terlalu fokus ke kemungkinan aneh. Sok penyelamat dunia, tapi malah jadi makin bingung sendiri. Kalau galau, bisa bikin drama psikologis sampai bikin temen takut deket-deket. Hatinya kayak puzzle yang gak pernah kelar.",
  "Aquarius-INFP": "Aquarius-INFP itu pemimpi unik yang nyemplung di dunia fantasi terus lupa balik ke kenyataan. Punya hati lembut, tapi suka benci sama keramaian karena terlalu banyak stimulus. Suka nulis puisi dan lagu, tapi jarang ada yang ngerti karena terlalu abstrak. Kalau disuruh jelas-jelas, jawabannya malah ngambang kayak awan yang gak tentu arah.",
  "Aquarius-ENTJ": "Aquarius-ENTJ itu bos revolusioner yang selalu pengen rubah dunia, tapi kadang lupa aturan dasar sosial. Sok tegas dan penuh visi besar, tapi sering nabrak tembok karena gak sabaran. Suka ngatur orang lain, tapi kalau idenya gak diterima langsung uring-uringan kayak anak kecil gak dikasih mainan. Sok logis tapi dalemnya gampang baper.",
  "Aquarius-ENTP": "Aquarius-ENTP itu mastermind chaos yang selalu penuh ide liar dan debat tanpa henti. Suka bikin lelucon yang cuma dia yang ngerti, dan kadang bikin orang lain bingung. Punya energi tak terbatas, tapi susah fokus sampai sering ngelantur ke topik aneh. Sok pede dan kreatif, tapi sebenarnya suka galau soal makna hidup dan eksistensi diri.",
  "Aquarius-ENFJ": "Aquarius-ENFJ itu pemimpin karismatik yang pengen semua orang happy, tapi suka lupa ngurusin diri sendiri. Selalu jadi pusat perhatian dan penggerak komunitas, tapi kadang kelelahan karena gak bisa bilang 'tidak.' Suka mikirin masa depan orang lain, tapi masa depan sendiri suka keteteran. Kalau disinggung masalah pribadinya, langsung tutup mulut kayak pintu baja.",
  "Aquarius-ENFP": "Aquarius-ENFP itu social butterfly penuh ide brilian yang kadang kelewat random. Suka banget bikin rencana besar, tapi sering berubah pikiran dan susah konsisten. Sok ceria dan terbuka, tapi dalemnya suka insecure dan bingung mau jadi apa. Kalau dibilang serius, langsung ngeles kayak anak kecil yang ketahuan bohong.",
  "Aquarius-ISTJ": "Aquarius-ISTJ itu pengatur terorganisir yang mau semuanya sempurna, tapi otaknya Aquarius bikin dia kadang jadi alien di lingkungannya sendiri. Suka bikin aturan ketat, tapi sering bingung sendiri karena gak semua orang bisa ikutin standarnya. Sok disiplin tapi suka overthink hal kecil sampai ribet sendiri kayak robot yang error.",
  "Aquarius-ISFJ": "Aquarius-ISFJ itu pelindung yang penuh kasih sayang tapi sering merasa gak dihargai. Suka ngorbanin diri buat orang lain, tapi kadang kesel karena usaha kerasnya gak keliatan. Keliatan kalem, tapi dalemnya penuh konflik antara pengen bantu dan pengen dimengerti. Suka bilang 'aku baik-baik saja' tapi sebenernya pengen banget diperhatikan.",
  "Aquarius-ISFP": "Aquarius-ISFP itu seniman yang unik dan mandiri, tapi kadang suka bingung sama perasaannya sendiri. Punya vibe misterius dan suka menjauh kalau dunia terlalu ribet. Suka berekspresi lewat karya, tapi kadang mood swing bikin karya juga jadi nggak konsisten. Suka bilang 'aku bebas' tapi sering baper kalau dikritik soal karya seni.",
  "Aquarius-ISTP": "Aquarius-ISTP itu si problem solver yang cool dan logis, tapi kadang terlalu cuek sampe terkesan dingin. Suka ngilang pas masalah datang, kayak ninja modern yang menghindar. Sok mandiri tapi dalem hati pengen diperhatiin. Kalau ada drama, dia lebih milih kabur dari pada ribet, tapi di belakang layar sering mikir ribet sendiri.",
  "Aquarius-ESFP": "Aquarius-ESFP itu jiwa pesta yang enerjik dan penuh gaya, tapi hatinya gampang baper dan cemas. Suka jadi pusat perhatian dan bikin suasana heboh, tapi malamnya bisa galau mikirin masa depan yang gak pasti. Hidupnya kayak rollercoaster penuh warna, kadang ceria, kadang mellow tanpa alasan jelas. Suka drama tapi gak mau keliatan lemah.",
  "Aquarius-ESTP": "Aquarius-ESTP itu petualang tanpa batas yang suka ambil risiko dan hidup di saat ini, tapi gampang galau kalau gagal. Sok pede dan jago bikin keputusan cepat, tapi pas urusan perasaan langsung mumet dan bingung. Sok tegas dan berani, tapi sebenarnya sering bingung sama arah hidupnya sendiri. Kalau disuruh serius, sering melipir cari alasan.",
  "Aquarius-ESFJ": "Aquarius-ESFJ itu tukang ngurus yang peduli banget sama orang, tapi kadang terlalu ikut campur sampai capek sendiri. Suka bantuin tapi suka kesel kalau gak dihargai. Keliatan ceria dan ramah, tapi dalemnya sering merasa sepi dan gak dimengerti. Suka pamer kebaikan, tapi pas sendirian malah overthinking soal kenapa gak cukup baik.",
  "Aquarius-ESTJ": "Aquarius-ESTJ itu pemimpin keras kepala yang pengen segalanya berjalan sesuai rencana, tapi otaknya Aquarius bikin dia sering ngelantur jauh dari kenyataan. Sok tegas dan disiplin, tapi kalau ide-idenya ditolak langsung ngambek kayak anak kecil. Suka ngatur orang lain, tapi kadang lupa ngatur dirinya sendiri yang berantakan.",
    
{
  "Capricorn-INTJ": "Capricorn-INTJ itu seperti CEO yang lahir dari rahim spreadsheet. Mereka punya rencana hidup lima tahun ke depan, lengkap dengan backup plan dan analisis SWOT. Tapi saat disuruh bersosialisasi, ekspresinya kayak robot yang kehabisan baterai. Mereka bisa memimpin tim dengan efisien, tapi lupa bahwa manusia punya perasaan. Saking perfeksionisnya, mereka bisa stres sendiri kalau ada yang melenceng 0.01% dari rencana. Kayak main catur dengan diri sendiri, selalu mikir sepuluh langkah ke depan, tapi lupa nikmatin langkah yang sekarang.",
  "Capricorn-INTP": "Capricorn-INTP itu kombinasi antara profesor eksentrik dan akuntan yang terlalu serius. Mereka bisa menghabiskan waktu berjam-jam menganalisis teori yang bahkan belum ada, tapi lupa bayar tagihan listrik. Logika mereka tajam, tapi kadang terlalu rumit sampai orang lain bingung sendiri. Mereka suka debat, tapi lebih sering debat dengan diri sendiri di kepala. Kalau disuruh ambil keputusan cepat, mereka malah bikin diagram alur dulu. Saking mikirnya, mereka bisa lupa kalau hidup juga butuh dijalani, bukan cuma dianalisis.",
  "Capricorn-INFJ": "Capricorn-INFJ itu seperti penyair yang terjebak di tubuh manajer proyek. Mereka punya visi besar untuk menyelamatkan dunia, tapi terlalu sibuk menyusun to-do list harian. Mereka peduli banget sama orang lain, tapi sering lupa ngurus diri sendiri. Saking idealisnya, mereka bisa kecewa berat kalau realita nggak sesuai harapan. Mereka bisa jadi teman curhat terbaik, tapi pas giliran mereka curhat, malah milih nulis di jurnal rahasia. Kayak perpaduan antara hati yang lembut dan kepala yang penuh strategi.",
  "Capricorn-INFP": "Capricorn-INFP itu seniman yang mencoba hidup di dunia korporat. Mereka punya jiwa kreatif yang mendalam, tapi terjebak dalam rutinitas 9 to 5. Mereka bisa menulis puisi tentang laporan keuangan, dan menangis karena typo di email. Mereka ingin hidup sesuai nilai-nilai mereka, tapi sering merasa bersalah kalau nggak produktif. Saking idealisnya, mereka bisa stres sendiri kalau dunia nggak seindah imajinasi mereka. Mereka adalah bukti bahwa bahkan di dunia yang kaku, masih ada ruang untuk mimpi.",
  "Capricorn-ENTJ": "Capricorn-ENTJ itu pemimpin alami yang lahir dengan rencana lima tahun di tangan. Mereka bisa memimpin tim dengan efisien, tapi kadang lupa bahwa bawahannya juga manusia, bukan robot. Mereka ambisius sampai kadang nggak sadar udah melewati batas. Saking fokusnya pada tujuan, mereka bisa lupa menikmati proses. Mereka percaya bahwa istirahat itu untuk yang lemah, padahal tubuh mereka udah teriak minta libur. Tapi jangan salah, di balik sikap tegasnya, mereka juga punya sisi lembut yang jarang ditunjukkan.",
  "Capricorn-ENTP": "Capricorn-ENTP itu seperti pengacara yang juga stand-up comedian. Mereka bisa debat tentang topik serius sambil melempar lelucon sarkastik. Mereka punya ide-ide brilian, tapi sering loncat dari satu proyek ke proyek lain sebelum selesai. Mereka suka tantangan, tapi kadang terlalu banyak tantangan yang diambil sekaligus. Saking kreatifnya, mereka bisa bikin solusi untuk masalah yang belum ada. Tapi jangan harap mereka bisa duduk diam lama-lama, karena otaknya selalu bergerak 100 km/jam.",
  "Capricorn-ENFJ": "Capricorn-ENFJ itu mentor yang selalu siap membantu, tapi sering lupa bantu diri sendiri. Mereka peduli banget sama kesejahteraan orang lain, sampai kadang mengorbankan waktu dan energi pribadi. Mereka bisa jadi inspirasi bagi banyak orang, tapi di balik itu semua, mereka menyimpan beban yang nggak sedikit. Saking fokusnya pada orang lain, mereka bisa kehilangan arah hidup sendiri. Tapi dengan sedikit refleksi, mereka bisa menemukan kembali cahaya dalam diri mereka.",
  "Capricorn-ENFP": "Capricorn-ENFP itu seperti pelukis yang mencoba hidup sesuai jadwal ketat. Mereka penuh semangat dan ide-ide kreatif, tapi sering kewalahan dengan struktur dan aturan. Mereka ingin bebas berekspresi, tapi juga merasa bersalah kalau nggak produktif. Saking antusiasnya, mereka bisa mulai banyak proyek sekaligus, tapi jarang yang selesai. Mereka adalah bukti bahwa bahkan dalam dunia yang terstruktur, masih ada ruang untuk warna-warni imajinasi.",
  "Capricorn-ISTJ": "Capricorn-ISTJ itu seperti jam Swiss: presisi, andal, dan kadang terlalu kaku. Mereka punya standar tinggi dan nggak suka perubahan mendadak. Mereka bisa diandalkan dalam situasi apapun, tapi kadang terlalu fokus pada aturan sampai lupa fleksibilitas itu penting. Saking seriusnya, mereka bisa bikin suasana jadi tegang hanya dengan diam. Tapi di balik itu semua, mereka punya hati yang tulus dan niat baik untuk menjaga ketertiban.",
  "Capricorn-ISFJ": "Capricorn-ISFJ itu penjaga tradisi yang setia dan penuh kasih. Mereka selalu siap membantu orang lain, tapi sering mengabaikan kebutuhan sendiri. Mereka suka rutinitas dan kenyamanan, tapi kadang takut mencoba hal baru. Saking pedulinya, mereka bisa merasa bersalah kalau nggak bisa memenuhi harapan semua orang. Tapi dengan sedikit dorongan, mereka bisa menemukan keberanian untuk keluar dari zona nyaman.",
  "Capricorn-ISFP": "Capricorn-ISFP itu seniman yang tersembunyi di balik sikap pendiam. Mereka punya kepekaan estetika yang tinggi, tapi sering ragu mengekspresikan diri. Mereka menghargai keindahan dalam hal-hal sederhana, tapi kadang merasa dunia terlalu kasar untuk jiwa mereka yang lembut. Saking sensitifnya, mereka bisa terluka oleh kritik kecil. Tapi dengan dukungan yang tepat, mereka bisa bersinar dengan karya-karya indah mereka.",
  "Capricorn-ISTP": "Capricorn-ISTP itu teknisi handal yang lebih suka berbicara dengan alat daripada manusia. Mereka jago memecahkan masalah praktis, tapi kadang kesulitan mengekspresikan perasaan. Mereka suka tantangan dan petualangan, tapi juga menghargai waktu sendiri. Saking mandirinya, mereka bisa terlihat dingin atau acuh. Tapi di balik itu, mereka punya rasa ingin tahu yang besar dan semangat untuk belajar.",
  "Capricorn-ESFP": "Capricorn-ESFP itu bintang panggung yang juga punya rencana keuangan lima tahun ke depan. Mereka suka bersenang-senang dan jadi pusat perhatian, tapi juga mikir panjang tentang masa depan. Mereka bisa membuat suasana jadi hidup, tapi kadang terlalu fokus pada penampilan. Saking enerjiknya, mereka bisa kelelahan sendiri. Tapi dengan keseimbangan yang tepat, mereka bisa menikmati hidup sambil tetap bertanggung jawab.",
  "Capricorn-ESTP": "Capricorn-ESTP itu petualang yang juga punya spreadsheet untuk setiap perjalanan. Mereka suka tantangan dan aksi, tapi juga nggak lupa mencatat pengeluaran. Mereka bisa mengambil keputusan cepat, tapi kadang terlalu impulsif. Saking beraninya, mereka bisa terjebak dalam situasi berisiko. Tapi dengan sedikit perencanaan, mereka bisa menaklukkan dunia.",
  "Capricorn-ESFJ": "Capricorn-ESFJ itu ibu rumah tangga yang juga CEO keluarga. Mereka peduli banget sama kesejahteraan orang lain, tapi kadang lupa istirahat. Mereka suka menjaga tradisi dan keharmonisan, tapi juga bisa keras kepala. Saking sibuknya ngurusin orang lain, mereka bisa kehilangan waktu untuk diri sendiri. Tapi dengan sedikit me-time, mereka bisa kembali bersinar.",
  "Capricorn-ESTJ": "Capricorn-ESTJ itu bos yang lahir, bukan dibuat. Mereka suka mengatur dan memastikan semuanya berjalan sesuai rencana. Mereka tegas dan efisien, tapi kadang terlalu kaku. Saking fokusnya pada aturan, mereka bisa lupa fleksibilitas itu penting. Tapi dengan sedikit kelonggaran, mereka bisa jadi pemimpin yang dihormati dan disukai.",

{
  "Scorpio-INTJ": "Scorpio-INTJ itu kayak orang yang maunya semua terencana rapi dan kelihatan cool, tapi dalem hati drama banget. Mereka sok misterius kayak tokoh film detektif, tapi sering banget nyimpen dendam receh kayak kucing yang kesel karena ga dikasih snack. Sering banget mikirin masa depan kayak peramal, tapi lupa ngejalanin sekarang. Suka bikin plan A-Z padahal baru niat doang, udah drama kalo gagal. Maunya kayak James Bond tapi lebih sering kayak plot film gagal tayang.",
  "Scorpio-INTP": "Scorpio-INTP itu kayak anak yang banyak mikir tapi males action. Sering banget bikin teori-teori konspirasi random sambil ngopi, tapi pas disuruh nyoba ide sendiri malah bingung dan mager. Dalam hatinya ada banyak banget rencana, tapi kebanyakan gagal di tengah jalan. Sering juga sok cuek padahal baperan. Kalau lagi mikir keras, ekspresinya kayak robot error. Suka ngomong filosofis padahal cuma nyari alesan buat ngelak dari tugas.",
  "Scorpio-INFJ": "Scorpio-INFJ itu kayak orang yang diem-diem bikin drama di kepala. Suka mikirin perasaan orang lain padahal diri sendiri udah capek mental. Sok misterius kayak tokoh utama drama Korea, padahal masalahnya cuma gara-gara nggak dibales chat. Suka bikin quotes galau tapi lupa kalo hidupnya sendiri kayak sinetron. Sering banget bilang 'nggak apa-apa' padahal abis itu mewek sendiri sambil dengerin playlist galau.",
  "Scorpio-INFP": "Scorpio-INFP tuh kayak penyair galau yang hatinya gampang kesentuh. Tiap liat sunset atau hujan dikit langsung mikirin mantan. Sok artistik dan pengen jadi seniman, padahal cuman bikin coretan di notes HP. Suka bikin drama sendiri padahal orang lain nggak ngerti dia lagi kenapa. Mood swing-nya tuh kayak sinyal HP di gunung: naik turun nggak jelas. Penuh harapan besar tapi realisasinya zonk.",
  "Scorpio-ENTJ": "Scorpio-ENTJ tuh kayak bos-bosan yang kelihatannya tegas banget, tapi dalemnya baperan parah. Suka ngomong galak di depan orang tapi pas sendirian malah overthinking sendiri. Maunya kelihatan keren dan punya kontrol penuh, padahal hidupnya sering chaos gara-gara overplanning. Kalau gagal dikit langsung drama kayak dunia mau kiamat. Gaya bossy tapi hati rapuh kayak kaca retak.",
  "Scorpio-ENTP": "Scorpio-ENTP tuh kayak badut cerdas yang suka bikin orang ketawa sambil mikir dalem. Pinter ngelawak tapi hatinya rapuh kayak bubble wrap. Suka ngomong nyelekit tapi diem-diem takut dibales. Kalau lagi rame bisa jadi bintang acara, tapi pas sendirian galau mikirin hal yang nggak penting. Maunya jadi unik, padahal kadang cuma bikin orang bingung sama tingkahnya.",
  "Scorpio-ENFJ": "Scorpio-ENFJ tuh kayak temen yang keliatannya peduli banget sama semua orang, tapi suka lupa mikirin dirinya sendiri. Suka jadi penyemangat orang lain, padahal sendiri capek banget. Kalau ada masalah malah sibuk ngurusin orang lain biar nggak mikirin masalahnya sendiri. Penuh cinta tapi sering kecewa karena ekspektasi nggak sesuai. Kalau gagal baper sendiri sambil bikin story sok bijak.",
  "Scorpio-ENFP": "Scorpio-ENFP tuh kayak kupu-kupu sosial yang rame tapi gampang baper. Suka banget ngobrol dan nyambungin cerita random, tapi pas sendirian galau parah. Penuh ide besar tapi sering lupa buat action. Sering banget bilang 'gue fine' padahal hatinya kayak es krim cair. Mood swing-nya parah, kayak kembang api yang meledak terus padam. Suka heboh tapi hatinya fragile.",
  "Scorpio-ISTJ": "Scorpio-ISTJ tuh kayak orang yang kelihatannya disiplin dan teratur, tapi sebenernya gampang kesel dan baperan. Suka bikin plan tapi sering stuck gara-gara mikir terlalu jauh. Mau jadi orang yang selalu siap, padahal dalem hati sering ngedumel karena nggak sesuai ekspektasi. Suka sok tegas tapi diem-diem mikirin hal sepele berjam-jam. Keliatan kaku tapi sebenernya hatinya lembut kayak marshmallow.",
  "Scorpio-ISFJ": "Scorpio-ISFJ tuh kayak orang yang selalu mau bikin semua orang seneng, padahal capek banget. Suka diem-diem ngalah biar nggak bikin masalah, tapi dalem hati kesel sendiri. Suka bilang 'gapapa' padahal lagi nangis sambil nonton drama. Pengen jadi orang yang selalu ada buat temen, tapi suka lupa ngurusin diri sendiri. Sok kuat padahal rapuh kayak gelas tipis.",
  "Scorpio-ISFP": "Scorpio-ISFP tuh kayak seniman yang keliatannya chill tapi mood swing-nya bikin pusing. Suka bikin hal estetik tapi kadang males banget. Sering bilang pengen healing padahal masalahnya sepele. Suka diem-diem galau kalo ngerasa nggak dihargai. Kalau lagi seneng, bisa heboh banget, tapi kalo lagi bete langsung ngilang kayak ninja. Hatimu kayak balon: gampang meledak kalo disentuh dikit.",
  "Scorpio-ISTP": "Scorpio-ISTP tuh kayak ninja yang cool tapi sebenernya gampang baper. Suka ngilang tiba-tiba dari keramaian, terus dateng lagi kayak nggak ada apa-apa. Suka main logika, tapi kalau ada masalah pribadi malah drama kayak sinetron. Maunya keliatan keren dan nggak peduli, padahal hatinya kayak spons yang nyerap semua emosi. Suka ngomong sok cuek padahal baper setengah mati.",
  "Scorpio-ESFP": "Scorpio-ESFP tuh kayak selebgram yang selalu keliatan seru di luar, tapi pas malem diem-diem nangis mikirin hidup. Suka jadi pusat perhatian tapi hatinya rapuh kayak tisu. Sering banget bikin story heboh biar kelihatan happy, padahal di balik layar lagi galau. Punya banyak temen tapi kadang ngerasa kesepian. Hidupnya penuh warna tapi kadang kayak film drama.",
  "Scorpio-ESTP": "Scorpio-ESTP tuh kayak orang yang berani ambil resiko tapi panikan kalau gagal. Suka keliatan rebel dan berani, tapi pas sendirian malah mikir 'kenapa gue gini banget?'. Sering sok cool di depan orang tapi aslinya hati lemah kayak biskuit. Punya banyak akal buat keluar dari masalah, tapi sering juga bikin masalah sendiri. Ngomongnya tegas tapi hatinya penuh drama.",
  "Scorpio-ESFJ": "Scorpio-ESFJ tuh kayak mamah muda yang pengen semua orang happy tapi lupa diri sendiri. Suka banget bikin acara seru, tapi pas sepi malah ngerasa nggak dihargai. Suka keliatan rame dan ceria, padahal hatinya kayak tumpukan laundry: penuh beban. Sering banget bikin story pamer masakan padahal hatinya galau. Suka drama kecil tapi sok tegar.",
  "Scorpio-ESTJ": "Scorpio-ESTJ tuh kayak bos kecil yang pengen semua teratur tapi gampang baper. Suka ngomong tegas dan keliatan galak, tapi pas ada yang kritik langsung overthinking. Pengen banget keliatan tangguh dan nggak butuh orang lain, padahal sebenernya pengen dipeluk. Hidupnya penuh plan tapi sering drama sendiri kalo plan-nya nggak jalan. Keliatan bossy tapi hatinya lembut kayak roti sobek.",
    
  "Sagittarius-INTJ": "Sagittarius-INTJ itu kayak si arsitek yang punya segudang rencana buat bikin dunia yang keren banget, tapi realitanya lupa bayar listrik rumah sendiri. Sok visioner, padahal suka males ngerjain hal kecil. Ngomongnya terstruktur kayak bikin blueprint, tapi pas prakteknya bingung sendiri. Sering mikir 'gue harus sukses' tapi pas bangun kesiangan terus drama nggak jelas di kepala.",
  "Sagittarius-INTP": "Sagittarius-INTP kayak kombinasi alien dan manusia: mikirnya random, idenya banyak, tapi pas disuruh action malah bengong kayak nunggu wangsit. Suka ngomongin teori tinggi padahal pas praktik malah lupa caranya. Ngomongnya suka loncat-loncat, bikin orang bingung ini ngomongin apa sih? Punya ribuan plan tapi cuma jadi draft di catatan HP. Pas gagal malah bikin teori baru buat nutupin malu.",
  "Sagittarius-INFJ": "Sagittarius-INFJ tuh kayak tokoh film indie yang hidupnya penuh filosofi dan rahasia. Suka bilang 'aku ngerti perasaanmu' padahal dalem hati bingung juga. Punya visi mulia buat dunia, tapi pas diajak ngumpul malah ngilang kayak ninja. Overthinking-nya bukan kaleng-kaleng: bisa mikir sampe masa depan yang belum tentu kejadian. Keliatannya calm, padahal hatinya kayak balon penuh air siap meledak.",
  "Sagittarius-INFP": "Sagittarius-INFP tuh kayak penyair yang sok nyantai tapi hatinya fragile. Sering bilang pengen hidup bebas, tapi kalo ditinggal malah mewek diem-diem. Mood swing-nya ekstrim: dari ketawa ngakak ke galau mikirin mantan. Punya mimpi gede, tapi kadang lupa langkah pertama. Ngomongnya puitis, padahal ujungnya curhat nggak jelas. Kayak kupu-kupu yang sayapnya indah tapi gampang sobek.",
  "Sagittarius-ENTJ": "Sagittarius-ENTJ kayak CEO wannabe yang gayanya bossy, tapi pas diomelin malah drama diem-diem. Suka ngomong tegas tapi sebenernya hatinya kayak es krim meleleh. Ambisius banget, tapi kalau plan-nya gagal langsung overthinking kayak lagi main catur lawan diri sendiri. Suka bilang 'gue tau jalan keluarnya' padahal bingung juga. Nggak mau keliatan lemah, padahal hatinya kayak spons: gampang nyerap kritik.",
  "Sagittarius-ENTP": "Sagittarius-ENTP kayak badut cerdas yang nggak bisa diem. Ide-idenya banyak banget, kayak popcorn meledak. Suka ngomong random, bikin orang bingung ini serius apa bercanda. Keliatannya santai, tapi pas sendirian suka overthinking sampe mikir alien beneran ada. Suka bikin jokes receh biar nggak keliatan rapuh. Energinya kayak baterai alkaline, tapi kadang drop pas nggak ada yang nonton.",
  "Sagittarius-ENFJ": "Sagittarius-ENFJ tuh kayak influencer yang suka bikin semua orang happy, tapi lupa buat recharge diri sendiri. Suka jadi tempat curhat orang lain, tapi pas curhat malah bilang 'gapapa kok' padahal nangis di kamar. Suka bikin plan seru, tapi akhirnya capek sendiri. Keliatan ramah dan perhatian, padahal kadang hatinya kayak bubble wrap: kelihatan kuat tapi gampang pecah.",
  "Sagittarius-ENFP": "Sagittarius-ENFP kayak kembang api: penuh warna, seru, tapi meledak tanpa aba-aba. Suka banget ngomong, bercanda, bikin heboh, tapi pas sepi malah nangis sendiri. Mimpinya segede langit, tapi kadang lupa caranya naik tangga. Suka bilang 'I’m fine' padahal galau mikirin masa depan. Energinya kayak ombak: naik turun, kadang bikin orang bingung ini marah, seneng, atau bosen.",
  "Sagittarius-ISTJ": "Sagittarius-ISTJ tuh kayak planner yang ngotot hidup rapi, tapi sebenernya nggak konsisten. Suka bikin to-do list panjang kayak skripsi, tapi baru halaman satu udah mager. Keliatannya tegas dan disiplin, tapi dalem hati suka drama kecil-kecilan. Punya prinsip hidup, tapi kadang suka lupa prinsipnya sendiri pas lagi capek. Kayak kalkulator yang suka error kalau ditekan berkali-kali.",
  "Sagittarius-ISFJ": "Sagittarius-ISFJ kayak boneka teddy bear: keliatan kalem, tapi dalemnya penuh drama. Suka ngalah biar semua seneng, tapi akhirnya capek sendiri. Suka diem-diem baper, terus pura-pura nggak apa-apa. Kalo lagi bete, malah sibuk bikin kue atau nonton drama Korea buat pelarian. Kayak lilin yang terus nyala buat orang lain, tapi lupa buat diri sendiri. Sok strong tapi hatinya lembek kayak marshmallow.",
  "Sagittarius-ISFP": "Sagittarius-ISFP kayak seniman yang hidupnya aesthetic tapi berantakan. Suka bilang butuh healing, padahal masalahnya receh banget. Mood swing-nya bikin rollercoaster kalah. Pengen bebas, tapi baper kalau diabaikan. Suka bikin konten lucu buat nutupin drama pribadi. Keliatannya chill, tapi dalem hati kayak sirup yang tumpah: lengket, berantakan, dan gampang meleleh.",
  "Sagittarius-ISTP": "Sagittarius-ISTP kayak ninja yang sok cool, tapi kalo kena masalah malah drama diem-diem. Suka ngilang dari keramaian terus balik kayak nggak ada apa-apa. Maunya keliatan logis dan santai, tapi hatinya rapuh kayak kertas basah. Suka bikin keputusan cepat, tapi pas gagal malah mikir panjang. Keliatannya tegar, tapi sebenernya cuma nggak mau keliatan lemah di depan orang lain.",
  "Sagittarius-ESFP": "Sagittarius-ESFP tuh kayak artis dadakan: seru, rame, tapi pas ditinggal sendirian langsung galau. Suka bikin story seru biar nggak keliatan sedih. Punya banyak temen, tapi dalem hati kadang ngerasa kosong. Suka heboh di luar, tapi rapuh di dalam. Kalau bete, hobinya bikin konten joget-joget biar lupa masalah. Kayak es krim rainbow: cantik tapi gampang cair kalau panas.",
  "Sagittarius-ESTP": "Sagittarius-ESTP kayak petualang yang sok berani tapi aslinya baperan. Suka bilang YOLO, tapi pas ditinggal malah galau nonton drama. Keliatan cuek, tapi sebenernya overthinking juga. Suka bikin plan spontan yang berakhir berantakan. Ngomongnya sok pede, padahal kadang ngarang juga. Kayak kue lapis: keliatan keren, tapi dalemnya rapuh. Sok rebel tapi hatinya selembut kapas.",
  "Sagittarius-ESFJ": "Sagittarius-ESFJ kayak tukang pesta yang pengen semua happy, tapi lupa recharge diri sendiri. Suka ngurusin orang lain, tapi malah ngelupain kebutuhan diri. Keliatan rame, tapi pas di rumah diem sambil overthinking. Suka upload foto rame biar keliatan bahagia, padahal dalem hati pengen curhat panjang. Kayak kue ulang tahun: penuh hiasan tapi gampang hancur kalo dipotong dikit.",
  "Sagittarius-ESTJ": "Sagittarius-ESTJ kayak bos kecil yang pengen semuanya teratur, tapi suka panik kalo nggak sesuai rencana. Suka ngomong tegas dan sok yakin, padahal dalem hati bingung juga. Pengen keliatan kuat, tapi hatinya kayak bolu kukus: empuk dan gampang penyok. Keliatan garang, tapi pas ditegur malah drama kecil-kecilan. Ambisius banget, tapi kadang nggak konsisten juga.",
}
