{
    "Pisces-INTJ": "Ini orang tuh mikirnya deep banget, kayak penyelam yang nyari harta karun di dasar laut. Tapi kenyataannya, mereka malah sering nyasar di labirin pikiran sendiri. Kombinasi dreamy Pisces sama rencana besar INTJ bikin mereka kadang mikirnya jauh ke depan, tapi realitanya mereka masih stuck di masa lalu. Sering keliatan sok cool padahal cuma takut dibilang bego.",
    "Pisces-INTP": "Kombinasi ini tuh kayak kucing liar yang pura-pura cuek tapi hatinya rapuh. Suka overthinking sampe kebanyakan teori konspirasi di kepala, tapi pas disuruh praktek malah mewek karena gak sesuai ekspektasi. Terlalu mikirin 'What if?' sampe lupa buat ngejalanin hidup beneran. Ngomongnya suka random kayak ada coding error di otak.",
    "Pisces-INFJ": "Ini tuh tipe orang yang kalo galau bisa bikin novel 10 bab. Suka mikirin semua orang tapi diri sendiri diabaikan. Kombinasi antara sok misterius INFJ dan baperan Pisces bikin mereka kayak tokoh utama drama Korea yang nyimpen rahasia besar padahal masalahnya cuma gara-gara salah chat.",
    "Pisces-INFP": "Si tukang ngelamun yang hatinya lembut kayak es krim tapi rapuh kayak wafer. Setiap liat daun jatuh bisa langsung keinget mantan. Hidupnya kayak playlist galau Spotify. Mereka tuh kayak mau jadi seniman keren, tapi seringnya malah cuma nulis puisi di notes HP yang ga bakal dibaca orang.",
    "Pisces-ENTJ": "Nah ini unik, orang yang pengen banget jadi boss tapi hatinya sensitif kayak gelembung sabun. Sok tegas di luar, dalem hati pengen dimanja. Suka ngomelin orang tapi diem-diem nangis di kamar kalo orangnya bales ngatain. Ambisius, tapi baper kalo kena kritik.",
    "Pisces-ENTP": "Kombinasi chaos. Sok lucu, sok nyeleneh, tapi pas sendirian galau mikirin kenapa dia dilahirin sebagai Pisces. Sering bikin jokes sarkas yang orang lain bingung ini serius apa bercanda. Hatinya tuh rapuh, tapi dia nutupin pake becandaan receh.",
    "Pisces-ENFJ": "Si penyayang yang pengen semua orang bahagia, tapi lupa kalo dirinya sendiri juga butuh bahagia. Suka ngurusin orang lain sampe lupa diri sendiri tuh kayak botol parfum yang disemprot terus tapi isinya ga pernah diisi ulang. Kalo ditolak malah bikin puisi panjang kayak lagi bikin script FTV.",
    "Pisces-ENFP": "Ini mah kombinasi antara tukang overthink sama social butterfly. Sok heboh di luar, padahal dalem hati sering insecure sampe pengen kabur dari dunia. Punya mimpi gede banget, tapi kadang lupa buat action. Suka ngomong 'Iâm fine' padahal hatinya kayak es krim cair di siang bolong.",
    "Pisces-ISTJ": "Bayangin orang yang pengen banget hidup teratur, tapi otaknya Pisces yang random bikin mereka kayak printer yang paper jam terus. Suka bikin to-do list yang panjang, tapi akhirnya malah mager ngerjain. Kaku kayak papan, tapi hatinya lembut kayak jelly.",
    "Pisces-ISFJ": "Si pengabdi yang kadang terlalu baik sampe jadi korban. Suka diem-diem nahan sakit hati biar orang lain seneng. Keliatan tenang tapi dalemnya kayak tumpukan cucian yang belum diberesin. Suka bilang 'gapapa' padahal lagi nangis sambil nonton drama Korea.",
    "Pisces-ISFP": "Kombinasi seniman rapuh. Suka bikin aesthetic tapi hidupnya berantakan. Sering bilang 'gue butuh healing' padahal masalahnya cuma lupa beli pulsa. Suka bilang pengen bebas tapi malah baper kalo diabaikan. Mood swing-nya kayak rollercoaster.",
    "Pisces-ISTP": "Sok cool banget, kayak ninja yang jalan-jalan di mall. Tapi dalem hati gampang baper. Sering ngilang dari keramaian terus muncul lagi kayak ga ada apa-apa. Suka main logika, tapi pas dia yang kena masalah malah drama kayak sinetron.",
    "Pisces-ESFP": "Si tukang party yang hatinya kayak kapas. Seneng heboh, tapi kalo malem tiba-tiba galau mikirin ex. Hidupnya kayak instastory penuh filter, tapi pas ketemu langsung kayak 'kok lo diem?'. Suka drama sendiri terus upload story lagu galau.",
    "Pisces-ESTP": "Tipe yang berani bilang 'YOLO' tapi langsung galau kalo ditinggal. Sok rebel, sok seru, tapi pas ditinggal gebetan nangisnya diem-diem sambil nonton video lucu biar lupa. Ngomongnya sok tegas, padahal sebenernya bingung juga hidupnya.",
    "Pisces-ESFJ": "Si tukang ngurusin yang kadang pengen banget semua orang seneng. Sering terlalu baik sampe dimanfaatin. Keliatannya rame, padahal di rumah sering nangis kalo ngerasa ga dihargai. Suka bikin story pamer kue bikinan sendiri tapi endingnya galau.",
    "Pisces-ESTJ": "Kombinasi yang kayak bossy tapi baperan. Ngomongnya tegas kayak komandan, tapi kalo dikritik langsung diem sambil mikir 'emang aku seburuk itu ya?'. Suka mikir hidup tuh harus rapi, tapi pas gagal langsung drama seolah dunia kiamat.",
  "Aquarius-INTJ": "Alien nyasar yang terlalu sibuk mikirin masa depan ribuan langkah ke depan sampai lupa ada yang lagi ngomong sama dia. Rencananya selalu rumit kayak proyek NASA, tapi kalau diajak ngobrol santai, bahasanya kaku banget kayak ngomong sama robot. Kamu pengen ngasih dia headset biar diem, tapi dia bakal anggap kamu gak paham visi besarnya.",
  "Aquarius-INTP": "Otak encer yang suka banget analisa sampai ribet sendiri. Dia tuh asik diajak debat, tapi kadang kayak ngomong sama AI yang gak ngerti perasaan manusia. Ide-ide nyeleneh banyak, tapi pas disuruh praktek malah bingung mau mulai dari mana. Kamu harus sabar, soalnya dia suka nge-gas tanpa lihat situasi.",
  "Aquarius-INFJ": "Sok misterius tapi gampang baper. Mereka pengen dimengerti tapi susah buka diri. Kebanyakan mikir hal-hal abstrak sampe lupa makan. Kadang ngomongnya dalem banget kayak mau ngasih pencerahan, tapi sebenernya cuma bingung sama hidupnya sendiri. Kamu diajak curhat malah kayak ikut seminar psikologi.",
  "Aquarius-INFP": "Si idealis yang nyentrik banget. Mimpi-mimpi mereka tinggi, tapi realitanya suka mengambang. Suka ngelamun sambil dengerin musik indie, kadang hilang di dunianya sendiri. Kalo kamu ngajak ngobrol, mereka suka melantur ke topik yang gak nyambung tapi bikin kamu mikir dalam-dalam.",
  "Aquarius-ENTJ": "Boss yang otaknya meledak terus nyerang semua masalah kayak robot perang. Suka ngatur dan mau semua sesuai logika dia. Tapi, hati-hati, di balik sikap tegas itu, dia juga butuh diakui dan dihargai. Kalo dikritik, kadang bisa ngambek kayak anak kecil yang gak dapet mainan.",
  "Aquarius-ENTP": "Si tukang ide liar yang gak pernah kehabisan bahan buat debat. Suka bikin suasana rame dengan jokes yang kadang bikin bingung. Dia pandai banget bikin orang mikir dua kali, tapi juga gampang bosen sama hal yang monoton. Kadang kamu merasa dia lebih suka ngomong ke dirinya sendiri daripada ke kamu.",
  "Aquarius-ENFJ": "Sosok sosial yang perhatian tapi kadang terlalu banyak mikirin orang lain sampai lupa jaga diri sendiri. Suka jadi mediator, tapi kalo semua udah kacau, dia juga bisa panik sendiri. Mereka kadang terlalu idealis dan pengen semua orang selaras, padahal kadang dunia gak se-perfect itu.",
  "Aquarius-ENFP": "Si energik yang gak bisa diem. Dia pengen ngubah dunia tapi seringnya malah cuma ngopi dan ngelantur. Gampang baper tapi nutupin pake jokes. Kamu harus siap jadi pendengar curhatan yang tiba-tiba berubah jadi ide bisnis super keren. Kadang ide mereka terlalu ngaco, tapi bikin seru hidupmu.",
  "Aquarius-ISTJ": "Orang yang pengen hidup teratur tapi otaknya Aquarius bikin dia kayak komputer yang kena virus random. Suka banget ngatur aturan, tapi kadang kelabakan sendiri sama perubahan tiba-tiba. Kaku tapi punya sisi hangat yang jarang keliatan. Kalau dia ngomong, biasanya serius banget sampai bikin suasana beku.",
  "Aquarius-ISFJ": "Si pendengar setia yang diam-diam perhatian tapi susah banget buat bilang apa yang dia rasain. Mereka kayak pahlawan tanpa tanda jasa, selalu ada tapi gak pernah minta dihargai. Kadang suka bingung sendiri sama perubahan cepat di hidup, tapi tetap setia jaga orang-orang yang mereka sayang.",
  "Aquarius-ISFP": "Seniman yang suka kebebasan tapi kadang terlalu cuek. Suka hidup di zona nyaman dan ogah ribet, tapi sebenernya hati mereka dalam dan penuh warna. Gak suka drama, tapi kalo udah bete, mereka bisa hilang kayak angin yang gak keliatan. Kadang kamu harus sabar nunggu mood-nya balik normal.",
  "Aquarius-ISTP": "Si problem solver yang kelihatan dingin tapi sebenarnya perhatian. Suka ngelakuin hal praktis tapi gak suka diatur-atur. Kadang suka nyendiri buat mikir, tapi kalo udah kumpul, dia bisa jadi pusat perhatian dengan ide-idenya yang out of the box. Jangan kaget kalo dia tiba-tiba ngilang tanpa kabar.",
  "Aquarius-ESFP": "Si pusat perhatian yang hidupnya kayak pesta nonstop. Enerjik dan sosial, tapi kadang lupa buat mikirin konsekuensi. Suka spontan dan nggak betah di aturan yang ribet. Kadang kamu merasa mereka kayak hidup di dunia lain yang penuh warna dan musik. Kalo lagi bad mood, mereka drama banget deh.",
  "Aquarius-ESTP": "Tukang aksi yang gak takut ambil risiko. Mereka suka tantangan dan hidup di momen sekarang, tapi kadang terlalu gegabah sampai bikin orang lain panik. Sok pede dan suka pamer, tapi sebenernya juga mudah baper. Jangan heran kalo tiba-tiba berubah jadi serius dan introspektif, Aquarius juga manusia kok.",
  "Aquarius-ESFJ": "Si sosialita yang pengen semua orang senang, tapi kadang terlalu mikirin omongan orang sampe lupa diri sendiri. Suka jadi pusat perhatian tapi juga mudah baper sama kritikan kecil. Mereka yang paling rajin ngatur acara dan bikin grup chat rame, tapi jangan salah, kadang suka kesel juga sama drama yang dibuat teman sendiri.",
  "Aquarius-ESTJ": "Bossy yang gak mau kalah dan selalu pengen segala sesuatunya berjalan sesuai aturan dia. Tegas dan disiplin, tapi kadang terlalu kaku dan gak fleksibel. Suka marah-marah kecil yang bikin suasana panas, tapi kalau sudah dingin, mereka bisa jadi orang paling setia. Kadang kamu pengen bawa dia ke pantai biar rileks, tapi kayaknya mustahil.",
  "Capricorn-INTJ": "Capricorn-INTJ tuh kayak CEO di alam semesta yang serius banget. Mereka punya rencana hidup detail sampai mikir langkah selanjutnya sebelum bangun tidur. Tapi kadang terlalu kaku dan susah santai, bikin orang di sekitarnya merasa kayak ngobrol sama robot. Padahal, dalemnya mereka cuma takut gagal dan pengen diakui.",
  "Capricorn-INTP": "Ini tipe yang logisnya kebangetan, sampai kadang lupa kalo hidup gak selalu soal teori dan rumus. Capricornnya bikin mereka disiplin, tapi otak INTP bikin mereka suka ngelantur ke dunia ide aneh yang cuma mereka paham. Kalo diajak ngobrol serius, kadang kamu bingung dia lagi serius apa lagi ngelawak.",
  "Capricorn-INFJ": "Si penyusun strategi yang punya sisi emosional tersembunyi. Capricornnya bikin mereka fokus dan tanggung jawab, tapi INFJ-nya suka kebawa perasaan sampe susah tidur mikirin masalah orang lain. Kadang kayak supervisor drama yang pinter banget tapi gak pernah mau tunjukin kelemahan.",
  "Capricorn-INFP": "Capricorn bikin dia disiplin dan mandiri, tapi INFP-nya bikin dia baperan dan idealis. Mereka sering galau antara mau ngejar mimpi atau nyantai dulu. Sering banget kejebak di zona nyaman tapi ngomongnya sok kuat. Kalau udah sedih, diemnya kayak gunung es, kamu gak akan tahu apa yang sebenernya dirasain.",
  "Capricorn-ENTJ": "Boss beneran! Kombinasi Capricorn yang kerja keras dan ENTJ yang suka ngatur bikin mereka kayak komandan perang yang gak kenal lelah. Tapi jangan salah, kadang mereka gampang baper kalo usaha kerasnya gak dihargai. Suka ngomel tapi sebenarnya pengen dipeluk dan dibilang ‘kamu hebat’.",
  "Capricorn-ENTP": "Capricorn yang realistis bertabrakan sama ENTP yang suka ide liar. Mereka kayak pahlawan yang pengen serius tapi sering ketawa ngakak sendiri karena pikiran randomnya. Kadang kamu bingung dia mau ngatur hidup atau malah kabur dari tanggung jawab. Selalu ada drama kecil yang bikin hidup makin seru.",
  "Capricorn-ENFJ": "Si penyayang yang bertanggung jawab. Capricorn bikin dia bisa disiplin, ENFJ bikin dia perhatian sama orang lain. Tapi kadang suka lupa diri sendiri dan capek sendiri. Mereka yang paling rajin bantuin teman, tapi pas ada masalah mereka juga butuh dipeluk dan dimanjain, cuma gak mau bilang aja.",
  "Capricorn-ENFP": "Kombinasi idealis tapi penuh energi. Capricornnya bikin mereka terorganisir, ENFPnya bikin mereka suka petualangan. Sering bikin rencana tapi juga gampang bosen dan pindah haluan. Mereka suka ngomong tentang mimpi besar tapi kadang lupa mulai dari yang kecil. Kadang kamu perlu jadi penyemangat mereka biar gak nyasar terus.",
  "Capricorn-ISTJ": "Si pengatur sejati yang disiplin banget. Capricorn-ISTJ itu kayak mesin yang gak pernah mati, fokusnya tinggi tapi kadang terlalu kaku dan susah santai. Mereka suka banget bikin jadwal dan aturan, tapi kalau ada yang ngelanggar, langsung kayak hakim pengadilan yang gak kasih ampun.",
  "Capricorn-ISFJ": "Si pelindung yang setia dan selalu ada buat orang lain. Capricorn bikin dia rajin dan teratur, ISFJ bikin dia sensitif dan perhatian. Mereka suka nyimpan perasaan sendiri biar gak merepotkan orang, tapi sebenarnya hati mereka rapuh banget. Kalau kamu nyakitin dia, siap-siap deh kayak kena hujan badai.",
  "Capricorn-ISFP": "Seniman yang gak suka ribet tapi punya prinsip kuat. Capricorn bikin dia bisa fokus dan disiplin, ISFPnya bikin dia punya jiwa kreatif. Mereka suka cari ketenangan dan benci drama, tapi kalau sudah kesel, bisa diem lama kayak batu. Suka bingung mau nunjukin perasaan atau disembunyiin.",
  "Capricorn-ISTP": "Si praktis yang gak suka omong kosong. Capricorn bikin dia pekerja keras dan tahan banting, ISTPnya bikin dia problem solver yang jago cari solusi cepat. Kadang mereka dingin dan susah didekati, tapi sebenernya perhatian cuma gak pinter ekspresiin. Jangan heran kalo dia lebih suka kerja ketimbang ngomong.",
  "Capricorn-ESFP": "Si energik yang suka kesenangan tapi Capricornnya bikin dia harus bertanggung jawab. Mereka suka banget cari perhatian tapi juga gak mau kelihatan lemah. Kadang kamu bingung antara dia pengen party nonstop atau malah pengen diem santai mikirin hidup. Drama kecil? Pasti ada, tapi selalu seru.",
  "Capricorn-ESTP": "Pemberani dan spontan, tapi Capricornnya bikin dia bisa ngontrol diri. Mereka suka tantangan dan gak takut ambil risiko, tapi juga bisa serius kalo lagi perlu. Kadang suka overconfidence sampe bikin orang lain geleng kepala. Kalo kamu pengen ajak dia santai, siap-siap dia malah ngajak kamu ikut adu nyali.",
  "Capricorn-ESFJ": "Si pengatur yang perhatian sama semua orang. Capricorn bikin dia disiplin, ESFJ bikin dia suka ngurusin orang lain. Mereka yang paling rajin bikin acara dan jaga harmonis, tapi kadang suka stres sendiri karena pengen semua sempurna. Jangan lupa kasih dia waktu buat diri sendiri biar gak burnout.",
  "Capricorn-ESTJ": "Boss beneran yang gak mau kompromi soal aturan. Capricorn-ESTJ itu kayak general di medan perang, tegas, disiplin, dan kerja keras. Kadang suka ngatur sampai bikin orang lain kesel, tapi mereka cuma pengen semuanya berjalan lancar. Kalau kamu ngelewatin deadline, siap-siap dapet omelan ala komandan militer."
}
