  {
"Pisces-INTJ":"Pisces-INTJ itu kayak otak brilian yang nyasar di dunianya sendiri. Dia punya rencana besar dan visi jauh ke depan, tapi suka keteteran ngejalanin hal-hal simpel sehari-hari. Sering ngumpet di balik tembok dingin sok tenang, padahal otaknya ribet kayak detektif yang kebanyakan teori tanpa bukti. Sok rasional, tapi ujung-ujungnya baper juga.",
"Pisces-INTP":"Pisces-INTP itu otak paling nyeleneh dan random, suka overanalis tapi sering stuck di ide doang. Ngomongnya suka tiba-tiba lompat topik kayak lagu remix kacau. Overthinking tingkat dewa bikin dia kebanyakan mikir ‘what if’ sampe lupa kerjain tugas nyata. Pas disuruh action? Langsung freeze kayak laptop nge-hang.",
"Pisces-INFJ":"Pisces-INFJ itu master drama sejati. Bisa bikin konflik dalem kepala jadi lebih ribet dari sinetron. Sok misterius dan peka banget sama orang, tapi kadang kelewat baper sampai stres sendiri gara-gara salah chat atau kata-kata minor. Hatinya ibarat labirin rahasia, yang nyasar bisa susah keluar.",
"Pisces-INFP":"Pisces-INFP itu penyair galau yang setiap detik kayak adegan slow motion. Ngelamun dan kebawa perasaan sama hal-hal kecil sampai susah fokus. Suka bilang “aku beda,” tapi seringnya malah tenggelam dalam dunia imajinasi tanpa action nyata. Selalu sibuk bikin puisi tapi ujung-ujungnya cuma jadi draft yang nggak kelar-kelar.",
"Pisces-ENTJ":"Pisces-ENTJ itu bos tegas yang kadang lupa kalau dia juga manusia. Sok kuat dan penuh kontrol, tapi hati gampang pecah dan baperan kalau ada kritik pedas. Pengen jadi pemimpin keren tapi sering kelihatan overacting kayak drama queen di meeting. Kalau disindir, reaksinya meledak-ledak tapi diam-diam mikir “kenapa aku gak cukup baik?”",
"Pisces-ENTP":"Pisces-ENTP itu chaos incarnate, ide-ide liar tapi gak konsisten. Suka debat, ngerjain banyak hal sekaligus, tapi jarang ada yang selesai. Sok jago ngelawak tapi sering bikin bingung orang karena jokes-nya terlalu random. Pas sendirian? Galau berat soal makna hidup dan kenapa dirinya harus jadi Pisces yang baper.",
"Pisces-ENFJ":"Pisces-ENFJ itu penyelamat dunia yang sering lupa selamatin dirinya sendiri. Terlalu sibuk ngurusin orang lain sampai kelelahan dan burnout, tapi gak mau ngaku. Punya hati selembut kapas tapi pamer kuat. Kalau ada yang ngelarang bantuin, bisa galau berhari-hari, nulis puisi sedih yang cuma dia yang baca.",
"Pisces-ENFP":"Pisces-ENFP itu social butterfly yang penuh energi tapi dalemnya sering insecure banget. Suka cari perhatian dan bikin heboh, tapi gampang down kalau gak dapet respons yang diharapkan. Mimpi dan ide besar, tapi gampang ketipu sama diri sendiri. Sering bilang “aku baik-baik saja” padahal kayak es krim meleleh di terik matahari.",
"Pisces-ISTJ":"Pisces-ISTJ itu detail freak yang pengen semuanya rapi tapi otaknya Pisces bikin semuanya kacau. Bikin to-do list segunung, tapi ujungnya banyak yang nganggur. Sok disiplin tapi gampang kebawa perasaan kalau ada yang gak sesuai rencana. Kaku dan serius, tapi hati lembut yang cuma bisa dia sembunyiin dengan rapi.",
"Pisces-ISFJ":"Pisces-ISFJ itu pengabdi setia yang diam-diam nahan sakit hati supaya orang lain senang. Suka ngalah dan sering dimanfaatin, tapi jarang protes. Keliatan tenang dan sabar, tapi kalau terlalu banyak beban, bisa meledak tiba-tiba kayak bom waktu. Bilang “gapapa” tapi sebenarnya hati sedang hancur berantakan.",
"Pisces-ISFP":"Pisces-ISFP itu seniman hati yang hidupnya penuh warna dan drama kecil. Suka cari aesthetic tapi kadang mood swing-nya kayak rollercoaster tanpa rem. Ingin bebas tapi takut ditinggal, gampang baper kalau diabaikan. Sering bilang butuh healing tapi gak konsisten jalani prosesnya, malah ngulang pola lama terus.",
"Pisces-ISTP":"Pisces-ISTP itu si dingin dan misterius yang kelihatan cool banget, tapi gampang baper. Suka ngilang tanpa kabar, datang lagi kayak gak ada apa-apa. Pakai logika tajam buat orang lain tapi pas kena masalah sendiri langsung drama. Sok mandiri tapi dalam hati pengen dimanja dan dimengerti.",
"Pisces-ESFP":"Pisces-ESFP itu party animal yang hatinya sensitif kayak kapas. Seneng heboh dan rame, tapi kalau malem tiba-tiba galau mikirin mantan. Hidupnya kayak instastory penuh filter, tapi kalau ketemu langsung sunyi dan awkward. Suka drama sendiri lalu upload lagu galau yang bikin followers ikut bingung.",
"Pisces-ESTP":"Pisces-ESTP itu rebel yang pede dan berani, tapi galau banget kalau ditinggal gebetan. Sok tegas dan lantang ngomong, tapi sebenarnya bingung mau kemana hidupnya. Hobi ambil risiko, tapi pas susah langsung nangis diem-diem sambil nonton video lucu.",
"Pisces-ESFJ":"Pisces-ESFJ itu tukang ngurus yang selalu pengen semua orang senang, tapi sering dimanfaatin. Keliatan ceria dan ramah di luar, tapi di rumah sering nangis diam-diam. Punya hati besar tapi gak selalu bisa bilang “tidak.” Suka pamer hal-hal kecil, tapi ujung-ujungnya galau sendiri.",
"Pisces-ESTJ":"Pisces-ESTJ itu bossy dan tegas, tapi gampang baper. Ngomongnya tegas kayak komandan, tapi kalo dikritik langsung diem sambil mikir ‘emang aku seburuk itu ya?’. Suka mikir hidup tuh harus rapi, tapi pas gagal langsung drama seolah dunia kiamat.",
    
  "Aquarius-INTJ": "Aquarius-INTJ itu ilmuwan eksentrik yang otaknya selalu di awang-awang, jauh banget dari realita. Punya ide revolusioner, tapi sering lupa makan dan mandi karena terlalu sibuk mikirin masa depan. Sok dingin dan analitis, tapi ujung-ujungnya ngedumel sendiri karena rencana rumitnya gak jalan sesuai ekspektasi. Kayak alien yang tersesat di dunia manusia.",
  "Aquarius-INTP": "Aquarius-INTP itu kutu buku yang otaknya kayak labirin rumit penuh teori aneh. Suka debat sampai lawan ngomong kayak lawan robot, tapi pas disuruh keluar dari zona nyaman malah ngilang kayak hantu. Ide-idenya cemerlang tapi susah dieksekusi karena sibuk mikir kemungkinan terburuk. Ngomongnya random, kadang bikin bingung bahkan diri sendiri.",
  "Aquarius-INFJ": "Aquarius-INFJ itu jenius misterius yang suka overthink sampai stres. Dia pinter banget baca situasi tapi sering salah paham karena terlalu fokus ke kemungkinan aneh. Sok penyelamat dunia, tapi malah jadi makin bingung sendiri. Kalau galau, bisa bikin drama psikologis sampai bikin temen takut deket-deket. Hatinya kayak puzzle yang gak pernah kelar.",
  "Aquarius-INFP": "Aquarius-INFP itu pemimpi unik yang nyemplung di dunia fantasi terus lupa balik ke kenyataan. Punya hati lembut, tapi suka benci sama keramaian karena terlalu banyak stimulus. Suka nulis puisi dan lagu, tapi jarang ada yang ngerti karena terlalu abstrak. Kalau disuruh jelas-jelas, jawabannya malah ngambang kayak awan yang gak tentu arah.",
  "Aquarius-ENTJ": "Aquarius-ENTJ itu bos revolusioner yang selalu pengen rubah dunia, tapi kadang lupa aturan dasar sosial. Sok tegas dan penuh visi besar, tapi sering nabrak tembok karena gak sabaran. Suka ngatur orang lain, tapi kalau idenya gak diterima langsung uring-uringan kayak anak kecil gak dikasih mainan. Sok logis tapi dalemnya gampang baper.",
  "Aquarius-ENTP": "Aquarius-ENTP itu mastermind chaos yang selalu penuh ide liar dan debat tanpa henti. Suka bikin lelucon yang cuma dia yang ngerti, dan kadang bikin orang lain bingung. Punya energi tak terbatas, tapi susah fokus sampai sering ngelantur ke topik aneh. Sok pede dan kreatif, tapi sebenarnya suka galau soal makna hidup dan eksistensi diri.",
  "Aquarius-ENFJ": "Aquarius-ENFJ itu pemimpin karismatik yang pengen semua orang happy, tapi suka lupa ngurusin diri sendiri. Selalu jadi pusat perhatian dan penggerak komunitas, tapi kadang kelelahan karena gak bisa bilang 'tidak.' Suka mikirin masa depan orang lain, tapi masa depan sendiri suka keteteran. Kalau disinggung masalah pribadinya, langsung tutup mulut kayak pintu baja.",
  "Aquarius-ENFP": "Aquarius-ENFP itu social butterfly penuh ide brilian yang kadang kelewat random. Suka banget bikin rencana besar, tapi sering berubah pikiran dan susah konsisten. Sok ceria dan terbuka, tapi dalemnya suka insecure dan bingung mau jadi apa. Kalau dibilang serius, langsung ngeles kayak anak kecil yang ketahuan bohong.",
  "Aquarius-ISTJ": "Aquarius-ISTJ itu pengatur terorganisir yang mau semuanya sempurna, tapi otaknya Aquarius bikin dia kadang jadi alien di lingkungannya sendiri. Suka bikin aturan ketat, tapi sering bingung sendiri karena gak semua orang bisa ikutin standarnya. Sok disiplin tapi suka overthink hal kecil sampai ribet sendiri kayak robot yang error.",
  "Aquarius-ISFJ": "Aquarius-ISFJ itu pelindung yang penuh kasih sayang tapi sering merasa gak dihargai. Suka ngorbanin diri buat orang lain, tapi kadang kesel karena usaha kerasnya gak keliatan. Keliatan kalem, tapi dalemnya penuh konflik antara pengen bantu dan pengen dimengerti. Suka bilang 'aku baik-baik saja' tapi sebenernya pengen banget diperhatikan.",
  "Aquarius-ISFP": "Aquarius-ISFP itu seniman yang unik dan mandiri, tapi kadang suka bingung sama perasaannya sendiri. Punya vibe misterius dan suka menjauh kalau dunia terlalu ribet. Suka berekspresi lewat karya, tapi kadang mood swing bikin karya juga jadi nggak konsisten. Suka bilang 'aku bebas' tapi sering baper kalau dikritik soal karya seni.",
  "Aquarius-ISTP": "Aquarius-ISTP itu si problem solver yang cool dan logis, tapi kadang terlalu cuek sampe terkesan dingin. Suka ngilang pas masalah datang, kayak ninja modern yang menghindar. Sok mandiri tapi dalem hati pengen diperhatiin. Kalau ada drama, dia lebih milih kabur dari pada ribet, tapi di belakang layar sering mikir ribet sendiri.",
  "Aquarius-ESFP": "Aquarius-ESFP itu jiwa pesta yang enerjik dan penuh gaya, tapi hatinya gampang baper dan cemas. Suka jadi pusat perhatian dan bikin suasana heboh, tapi malamnya bisa galau mikirin masa depan yang gak pasti. Hidupnya kayak rollercoaster penuh warna, kadang ceria, kadang mellow tanpa alasan jelas. Suka drama tapi gak mau keliatan lemah.",
  "Aquarius-ESTP": "Aquarius-ESTP itu petualang tanpa batas yang suka ambil risiko dan hidup di saat ini, tapi gampang galau kalau gagal. Sok pede dan jago bikin keputusan cepat, tapi pas urusan perasaan langsung mumet dan bingung. Sok tegas dan berani, tapi sebenarnya sering bingung sama arah hidupnya sendiri. Kalau disuruh serius, sering melipir cari alasan.",
  "Aquarius-ESFJ": "Aquarius-ESFJ itu tukang ngurus yang peduli banget sama orang, tapi kadang terlalu ikut campur sampai capek sendiri. Suka bantuin tapi suka kesel kalau gak dihargai. Keliatan ceria dan ramah, tapi dalemnya sering merasa sepi dan gak dimengerti. Suka pamer kebaikan, tapi pas sendirian malah overthinking soal kenapa gak cukup baik.",
  "Aquarius-ESTJ": "Aquarius-ESTJ itu pemimpin keras kepala yang pengen segalanya berjalan sesuai rencana, tapi otaknya Aquarius bikin dia sering ngelantur jauh dari kenyataan. Sok tegas dan disiplin, tapi kalau ide-idenya ditolak langsung ngambek kayak anak kecil. Suka ngatur orang lain, tapi kadang lupa ngatur dirinya sendiri yang berantakan.",
    
  "Capricorn-INTJ": "Capricorn-INTJ itu seperti CEO yang lahir dari rahim spreadsheet. Mereka punya rencana hidup lima tahun ke depan, lengkap dengan backup plan dan analisis SWOT. Tapi saat disuruh bersosialisasi, ekspresinya kayak robot yang kehabisan baterai. Mereka bisa memimpin tim dengan efisien, tapi lupa bahwa manusia punya perasaan. Saking perfeksionisnya, mereka bisa stres sendiri kalau ada yang melenceng 0.01% dari rencana. Kayak main catur dengan diri sendiri, selalu mikir sepuluh langkah ke depan, tapi lupa nikmatin langkah yang sekarang.",
  "Capricorn-INTP": "Capricorn-INTP itu kombinasi antara profesor eksentrik dan akuntan yang terlalu serius. Mereka bisa menghabiskan waktu berjam-jam menganalisis teori yang bahkan belum ada, tapi lupa bayar tagihan listrik. Logika mereka tajam, tapi kadang terlalu rumit sampai orang lain bingung sendiri. Mereka suka debat, tapi lebih sering debat dengan diri sendiri di kepala. Kalau disuruh ambil keputusan cepat, mereka malah bikin diagram alur dulu. Saking mikirnya, mereka bisa lupa kalau hidup juga butuh dijalani, bukan cuma dianalisis.",
  "Capricorn-INFJ": "Capricorn-INFJ itu seperti penyair yang terjebak di tubuh manajer proyek. Mereka punya visi besar untuk menyelamatkan dunia, tapi terlalu sibuk menyusun to-do list harian. Mereka peduli banget sama orang lain, tapi sering lupa ngurus diri sendiri. Saking idealisnya, mereka bisa kecewa berat kalau realita nggak sesuai harapan. Mereka bisa jadi teman curhat terbaik, tapi pas giliran mereka curhat, malah milih nulis di jurnal rahasia. Kayak perpaduan antara hati yang lembut dan kepala yang penuh strategi.",
  "Capricorn-INFP": "Capricorn-INFP itu seniman yang mencoba hidup di dunia korporat. Mereka punya jiwa kreatif yang mendalam, tapi terjebak dalam rutinitas 9 to 5. Mereka bisa menulis puisi tentang laporan keuangan, dan menangis karena typo di email. Mereka ingin hidup sesuai nilai-nilai mereka, tapi sering merasa bersalah kalau nggak produktif. Saking idealisnya, mereka bisa stres sendiri kalau dunia nggak seindah imajinasi mereka. Mereka adalah bukti bahwa bahkan di dunia yang kaku, masih ada ruang untuk mimpi.",
  "Capricorn-ENTJ": "Capricorn-ENTJ itu pemimpin alami yang lahir dengan rencana lima tahun di tangan. Mereka bisa memimpin tim dengan efisien, tapi kadang lupa bahwa bawahannya juga manusia, bukan robot. Mereka ambisius sampai kadang nggak sadar udah melewati batas. Saking fokusnya pada tujuan, mereka bisa lupa menikmati proses. Mereka percaya bahwa istirahat itu untuk yang lemah, padahal tubuh mereka udah teriak minta libur. Tapi jangan salah, di balik sikap tegasnya, mereka juga punya sisi lembut yang jarang ditunjukkan.",
  "Capricorn-ENTP": "Capricorn-ENTP itu seperti pengacara yang juga stand-up comedian. Mereka bisa debat tentang topik serius sambil melempar lelucon sarkastik. Mereka punya ide-ide brilian, tapi sering loncat dari satu proyek ke proyek lain sebelum selesai. Mereka suka tantangan, tapi kadang terlalu banyak tantangan yang diambil sekaligus. Saking kreatifnya, mereka bisa bikin solusi untuk masalah yang belum ada. Tapi jangan harap mereka bisa duduk diam lama-lama, karena otaknya selalu bergerak 100 km/jam.",
  "Capricorn-ENFJ": "Capricorn-ENFJ itu mentor yang selalu siap membantu, tapi sering lupa bantu diri sendiri. Mereka peduli banget sama kesejahteraan orang lain, sampai kadang mengorbankan waktu dan energi pribadi. Mereka bisa jadi inspirasi bagi banyak orang, tapi di balik itu semua, mereka menyimpan beban yang nggak sedikit. Saking fokusnya pada orang lain, mereka bisa kehilangan arah hidup sendiri. Tapi dengan sedikit refleksi, mereka bisa menemukan kembali cahaya dalam diri mereka.",
  "Capricorn-ENFP": "Capricorn-ENFP itu seperti pelukis yang mencoba hidup sesuai jadwal ketat. Mereka penuh semangat dan ide-ide kreatif, tapi sering kewalahan dengan struktur dan aturan. Mereka ingin bebas berekspresi, tapi juga merasa bersalah kalau nggak produktif. Saking antusiasnya, mereka bisa mulai banyak proyek sekaligus, tapi jarang yang selesai. Mereka adalah bukti bahwa bahkan dalam dunia yang terstruktur, masih ada ruang untuk warna-warni imajinasi.",
  "Capricorn-ISTJ": "Capricorn-ISTJ itu seperti jam Swiss: presisi, andal, dan kadang terlalu kaku. Mereka punya standar tinggi dan nggak suka perubahan mendadak. Mereka bisa diandalkan dalam situasi apapun, tapi kadang terlalu fokus pada aturan sampai lupa fleksibilitas itu penting. Saking seriusnya, mereka bisa bikin suasana jadi tegang hanya dengan diam. Tapi di balik itu semua, mereka punya hati yang tulus dan niat baik untuk menjaga ketertiban.",
  "Capricorn-ISFJ": "Capricorn-ISFJ itu penjaga tradisi yang setia dan penuh kasih. Mereka selalu siap membantu orang lain, tapi sering mengabaikan kebutuhan sendiri. Mereka suka rutinitas dan kenyamanan, tapi kadang takut mencoba hal baru. Saking pedulinya, mereka bisa merasa bersalah kalau nggak bisa memenuhi harapan semua orang. Tapi dengan sedikit dorongan, mereka bisa menemukan keberanian untuk keluar dari zona nyaman.",
  "Capricorn-ISFP": "Capricorn-ISFP itu seniman yang tersembunyi di balik sikap pendiam. Mereka punya kepekaan estetika yang tinggi, tapi sering ragu mengekspresikan diri. Mereka menghargai keindahan dalam hal-hal sederhana, tapi kadang merasa dunia terlalu kasar untuk jiwa mereka yang lembut. Saking sensitifnya, mereka bisa terluka oleh kritik kecil. Tapi dengan dukungan yang tepat, mereka bisa bersinar dengan karya-karya indah mereka.",
  "Capricorn-ISTP": "Capricorn-ISTP itu teknisi handal yang lebih suka berbicara dengan alat daripada manusia. Mereka jago memecahkan masalah praktis, tapi kadang kesulitan mengekspresikan perasaan. Mereka suka tantangan dan petualangan, tapi juga menghargai waktu sendiri. Saking mandirinya, mereka bisa terlihat dingin atau acuh. Tapi di balik itu, mereka punya rasa ingin tahu yang besar dan semangat untuk belajar.",
  "Capricorn-ESFP": "Capricorn-ESFP itu bintang panggung yang juga punya rencana keuangan lima tahun ke depan. Mereka suka bersenang-senang dan jadi pusat perhatian, tapi juga mikir panjang tentang masa depan. Mereka bisa membuat suasana jadi hidup, tapi kadang terlalu fokus pada penampilan. Saking enerjiknya, mereka bisa kelelahan sendiri. Tapi dengan keseimbangan yang tepat, mereka bisa menikmati hidup sambil tetap bertanggung jawab.",
  "Capricorn-ESTP": "Capricorn-ESTP itu petualang yang juga punya spreadsheet untuk setiap perjalanan. Mereka suka tantangan dan aksi, tapi juga nggak lupa mencatat pengeluaran. Mereka bisa mengambil keputusan cepat, tapi kadang terlalu impulsif. Saking beraninya, mereka bisa terjebak dalam situasi berisiko. Tapi dengan sedikit perencanaan, mereka bisa menaklukkan dunia.",
  "Capricorn-ESFJ": "Capricorn-ESFJ itu ibu rumah tangga yang juga CEO keluarga. Mereka peduli banget sama kesejahteraan orang lain, tapi kadang lupa istirahat. Mereka suka menjaga tradisi dan keharmonisan, tapi juga bisa keras kepala. Saking sibuknya ngurusin orang lain, mereka bisa kehilangan waktu untuk diri sendiri. Tapi dengan sedikit me-time, mereka bisa kembali bersinar.",
  "Capricorn-ESTJ": "Capricorn-ESTJ itu bos yang lahir, bukan dibuat. Mereka suka mengatur dan memastikan semuanya berjalan sesuai rencana. Mereka tegas dan efisien, tapi kadang terlalu kaku. Saking fokusnya pada aturan, mereka bisa lupa fleksibilitas itu penting. Tapi dengan sedikit kelonggaran, mereka bisa jadi pemimpin yang dihormati dan disukai.",

  "Scorpio-INTJ": "Scorpio-INTJ itu kayak orang yang maunya semua terencana rapi dan kelihatan cool, tapi dalem hati drama banget. Mereka sok misterius kayak tokoh film detektif, tapi sering banget nyimpen dendam receh kayak kucing yang kesel karena ga dikasih snack. Sering banget mikirin masa depan kayak peramal, tapi lupa ngejalanin sekarang. Suka bikin plan A-Z padahal baru niat doang, udah drama kalo gagal. Maunya kayak James Bond tapi lebih sering kayak plot film gagal tayang.",
  "Scorpio-INTP": "Scorpio-INTP itu kayak anak yang banyak mikir tapi males action. Sering banget bikin teori-teori konspirasi random sambil ngopi, tapi pas disuruh nyoba ide sendiri malah bingung dan mager. Dalam hatinya ada banyak banget rencana, tapi kebanyakan gagal di tengah jalan. Sering juga sok cuek padahal baperan. Kalau lagi mikir keras, ekspresinya kayak robot error. Suka ngomong filosofis padahal cuma nyari alesan buat ngelak dari tugas.",
  "Scorpio-INFJ": "Scorpio-INFJ itu kayak orang yang diem-diem bikin drama di kepala. Suka mikirin perasaan orang lain padahal diri sendiri udah capek mental. Sok misterius kayak tokoh utama drama Korea, padahal masalahnya cuma gara-gara nggak dibales chat. Suka bikin quotes galau tapi lupa kalo hidupnya sendiri kayak sinetron. Sering banget bilang 'nggak apa-apa' padahal abis itu mewek sendiri sambil dengerin playlist galau.",
  "Scorpio-INFP": "Scorpio-INFP tuh kayak penyair galau yang hatinya gampang kesentuh. Tiap liat sunset atau hujan dikit langsung mikirin mantan. Sok artistik dan pengen jadi seniman, padahal cuman bikin coretan di notes HP. Suka bikin drama sendiri padahal orang lain nggak ngerti dia lagi kenapa. Mood swing-nya tuh kayak sinyal HP di gunung: naik turun nggak jelas. Penuh harapan besar tapi realisasinya zonk.",
  "Scorpio-ENTJ": "Scorpio-ENTJ tuh kayak bos-bosan yang kelihatannya tegas banget, tapi dalemnya baperan parah. Suka ngomong galak di depan orang tapi pas sendirian malah overthinking sendiri. Maunya kelihatan keren dan punya kontrol penuh, padahal hidupnya sering chaos gara-gara overplanning. Kalau gagal dikit langsung drama kayak dunia mau kiamat. Gaya bossy tapi hati rapuh kayak kaca retak.",
  "Scorpio-ENTP": "Scorpio-ENTP tuh kayak badut cerdas yang suka bikin orang ketawa sambil mikir dalem. Pinter ngelawak tapi hatinya rapuh kayak bubble wrap. Suka ngomong nyelekit tapi diem-diem takut dibales. Kalau lagi rame bisa jadi bintang acara, tapi pas sendirian galau mikirin hal yang nggak penting. Maunya jadi unik, padahal kadang cuma bikin orang bingung sama tingkahnya.",
  "Scorpio-ENFJ": "Scorpio-ENFJ tuh kayak temen yang keliatannya peduli banget sama semua orang, tapi suka lupa mikirin dirinya sendiri. Suka jadi penyemangat orang lain, padahal sendiri capek banget. Kalau ada masalah malah sibuk ngurusin orang lain biar nggak mikirin masalahnya sendiri. Penuh cinta tapi sering kecewa karena ekspektasi nggak sesuai. Kalau gagal baper sendiri sambil bikin story sok bijak.",
  "Scorpio-ENFP": "Scorpio-ENFP tuh kayak kupu-kupu sosial yang rame tapi gampang baper. Suka banget ngobrol dan nyambungin cerita random, tapi pas sendirian galau parah. Penuh ide besar tapi sering lupa buat action. Sering banget bilang 'gue fine' padahal hatinya kayak es krim cair. Mood swing-nya parah, kayak kembang api yang meledak terus padam. Suka heboh tapi hatinya fragile.",
  "Scorpio-ISTJ": "Scorpio-ISTJ tuh kayak orang yang kelihatannya disiplin dan teratur, tapi sebenernya gampang kesel dan baperan. Suka bikin plan tapi sering stuck gara-gara mikir terlalu jauh. Mau jadi orang yang selalu siap, padahal dalem hati sering ngedumel karena nggak sesuai ekspektasi. Suka sok tegas tapi diem-diem mikirin hal sepele berjam-jam. Keliatan kaku tapi sebenernya hatinya lembut kayak marshmallow.",
  "Scorpio-ISFJ": "Scorpio-ISFJ tuh kayak orang yang selalu mau bikin semua orang seneng, padahal capek banget. Suka diem-diem ngalah biar nggak bikin masalah, tapi dalem hati kesel sendiri. Suka bilang 'gapapa' padahal lagi nangis sambil nonton drama. Pengen jadi orang yang selalu ada buat temen, tapi suka lupa ngurusin diri sendiri. Sok kuat padahal rapuh kayak gelas tipis.",
  "Scorpio-ISFP": "Scorpio-ISFP tuh kayak seniman yang keliatannya chill tapi mood swing-nya bikin pusing. Suka bikin hal estetik tapi kadang males banget. Sering bilang pengen healing padahal masalahnya sepele. Suka diem-diem galau kalo ngerasa nggak dihargai. Kalau lagi seneng, bisa heboh banget, tapi kalo lagi bete langsung ngilang kayak ninja. Hatimu kayak balon: gampang meledak kalo disentuh dikit.",
  "Scorpio-ISTP": "Scorpio-ISTP tuh kayak ninja yang cool tapi sebenernya gampang baper. Suka ngilang tiba-tiba dari keramaian, terus dateng lagi kayak nggak ada apa-apa. Suka main logika, tapi kalau ada masalah pribadi malah drama kayak sinetron. Maunya keliatan keren dan nggak peduli, padahal hatinya kayak spons yang nyerap semua emosi. Suka ngomong sok cuek padahal baper setengah mati.",
  "Scorpio-ESFP": "Scorpio-ESFP tuh kayak selebgram yang selalu keliatan seru di luar, tapi pas malem diem-diem nangis mikirin hidup. Suka jadi pusat perhatian tapi hatinya rapuh kayak tisu. Sering banget bikin story heboh biar kelihatan happy, padahal di balik layar lagi galau. Punya banyak temen tapi kadang ngerasa kesepian. Hidupnya penuh warna tapi kadang kayak film drama.",
  "Scorpio-ESTP": "Scorpio-ESTP tuh kayak orang yang berani ambil resiko tapi panikan kalau gagal. Suka keliatan rebel dan berani, tapi pas sendirian malah mikir 'kenapa gue gini banget?'. Sering sok cool di depan orang tapi aslinya hati lemah kayak biskuit. Punya banyak akal buat keluar dari masalah, tapi sering juga bikin masalah sendiri. Ngomongnya tegas tapi hatinya penuh drama.",
  "Scorpio-ESFJ": "Scorpio-ESFJ tuh kayak mamah muda yang pengen semua orang happy tapi lupa diri sendiri. Suka banget bikin acara seru, tapi pas sepi malah ngerasa nggak dihargai. Suka keliatan rame dan ceria, padahal hatinya kayak tumpukan laundry: penuh beban. Sering banget bikin story pamer masakan padahal hatinya galau. Suka drama kecil tapi sok tegar.",
  "Scorpio-ESTJ": "Scorpio-ESTJ tuh kayak bos kecil yang pengen semua teratur tapi gampang baper. Suka ngomong tegas dan keliatan galak, tapi pas ada yang kritik langsung overthinking. Pengen banget keliatan tangguh dan nggak butuh orang lain, padahal sebenernya pengen dipeluk. Hidupnya penuh plan tapi sering drama sendiri kalo plan-nya nggak jalan. Keliatan bossy tapi hatinya lembut kayak roti sobek.",
    
  "Sagittarius-INTJ": "Sagittarius-INTJ itu kayak si arsitek yang punya segudang rencana buat bikin dunia yang keren banget, tapi realitanya lupa bayar listrik rumah sendiri. Sok visioner, padahal suka males ngerjain hal kecil. Ngomongnya terstruktur kayak bikin blueprint, tapi pas prakteknya bingung sendiri. Sering mikir 'gue harus sukses' tapi pas bangun kesiangan terus drama nggak jelas di kepala.",
  "Sagittarius-INTP": "Sagittarius-INTP kayak kombinasi alien dan manusia: mikirnya random, idenya banyak, tapi pas disuruh action malah bengong kayak nunggu wangsit. Suka ngomongin teori tinggi padahal pas praktik malah lupa caranya. Ngomongnya suka loncat-loncat, bikin orang bingung ini ngomongin apa sih? Punya ribuan plan tapi cuma jadi draft di catatan HP. Pas gagal malah bikin teori baru buat nutupin malu.",
  "Sagittarius-INFJ": "Sagittarius-INFJ tuh kayak tokoh film indie yang hidupnya penuh filosofi dan rahasia. Suka bilang 'aku ngerti perasaanmu' padahal dalem hati bingung juga. Punya visi mulia buat dunia, tapi pas diajak ngumpul malah ngilang kayak ninja. Overthinking-nya bukan kaleng-kaleng: bisa mikir sampe masa depan yang belum tentu kejadian. Keliatannya calm, padahal hatinya kayak balon penuh air siap meledak.",
  "Sagittarius-INFP": "Sagittarius-INFP tuh kayak penyair yang sok nyantai tapi hatinya fragile. Sering bilang pengen hidup bebas, tapi kalo ditinggal malah mewek diem-diem. Mood swing-nya ekstrim: dari ketawa ngakak ke galau mikirin mantan. Punya mimpi gede, tapi kadang lupa langkah pertama. Ngomongnya puitis, padahal ujungnya curhat nggak jelas. Kayak kupu-kupu yang sayapnya indah tapi gampang sobek.",
  "Sagittarius-ENTJ": "Sagittarius-ENTJ kayak CEO wannabe yang gayanya bossy, tapi pas diomelin malah drama diem-diem. Suka ngomong tegas tapi sebenernya hatinya kayak es krim meleleh. Ambisius banget, tapi kalau plan-nya gagal langsung overthinking kayak lagi main catur lawan diri sendiri. Suka bilang 'gue tau jalan keluarnya' padahal bingung juga. Nggak mau keliatan lemah, padahal hatinya kayak spons: gampang nyerap kritik.",
  "Sagittarius-ENTP": "Sagittarius-ENTP kayak badut cerdas yang nggak bisa diem. Ide-idenya banyak banget, kayak popcorn meledak. Suka ngomong random, bikin orang bingung ini serius apa bercanda. Keliatannya santai, tapi pas sendirian suka overthinking sampe mikir alien beneran ada. Suka bikin jokes receh biar nggak keliatan rapuh. Energinya kayak baterai alkaline, tapi kadang drop pas nggak ada yang nonton.",
  "Sagittarius-ENFJ": "Sagittarius-ENFJ tuh kayak influencer yang suka bikin semua orang happy, tapi lupa buat recharge diri sendiri. Suka jadi tempat curhat orang lain, tapi pas curhat malah bilang 'gapapa kok' padahal nangis di kamar. Suka bikin plan seru, tapi akhirnya capek sendiri. Keliatan ramah dan perhatian, padahal kadang hatinya kayak bubble wrap: kelihatan kuat tapi gampang pecah.",
  "Sagittarius-ENFP": "Sagittarius-ENFP kayak kembang api: penuh warna, seru, tapi meledak tanpa aba-aba. Suka banget ngomong, bercanda, bikin heboh, tapi pas sepi malah nangis sendiri. Mimpinya segede langit, tapi kadang lupa caranya naik tangga. Suka bilang 'I’m fine' padahal galau mikirin masa depan. Energinya kayak ombak: naik turun, kadang bikin orang bingung ini marah, seneng, atau bosen.",
  "Sagittarius-ISTJ": "Sagittarius-ISTJ tuh kayak planner yang ngotot hidup rapi, tapi sebenernya nggak konsisten. Suka bikin to-do list panjang kayak skripsi, tapi baru halaman satu udah mager. Keliatannya tegas dan disiplin, tapi dalem hati suka drama kecil-kecilan. Punya prinsip hidup, tapi kadang suka lupa prinsipnya sendiri pas lagi capek. Kayak kalkulator yang suka error kalau ditekan berkali-kali.",
  "Sagittarius-ISFJ": "Sagittarius-ISFJ kayak boneka teddy bear: keliatan kalem, tapi dalemnya penuh drama. Suka ngalah biar semua seneng, tapi akhirnya capek sendiri. Suka diem-diem baper, terus pura-pura nggak apa-apa. Kalo lagi bete, malah sibuk bikin kue atau nonton drama Korea buat pelarian. Kayak lilin yang terus nyala buat orang lain, tapi lupa buat diri sendiri. Sok strong tapi hatinya lembek kayak marshmallow.",
  "Sagittarius-ISFP": "Sagittarius-ISFP kayak seniman yang hidupnya aesthetic tapi berantakan. Suka bilang butuh healing, padahal masalahnya receh banget. Mood swing-nya bikin rollercoaster kalah. Pengen bebas, tapi baper kalau diabaikan. Suka bikin konten lucu buat nutupin drama pribadi. Keliatannya chill, tapi dalem hati kayak sirup yang tumpah: lengket, berantakan, dan gampang meleleh.",
  "Sagittarius-ISTP": "Sagittarius-ISTP kayak ninja yang sok cool, tapi kalo kena masalah malah drama diem-diem. Suka ngilang dari keramaian terus balik kayak nggak ada apa-apa. Maunya keliatan logis dan santai, tapi hatinya rapuh kayak kertas basah. Suka bikin keputusan cepat, tapi pas gagal malah mikir panjang. Keliatannya tegar, tapi sebenernya cuma nggak mau keliatan lemah di depan orang lain.",
  "Sagittarius-ESFP": "Sagittarius-ESFP tuh kayak artis dadakan: seru, rame, tapi pas ditinggal sendirian langsung galau. Suka bikin story seru biar nggak keliatan sedih. Punya banyak temen, tapi dalem hati kadang ngerasa kosong. Suka heboh di luar, tapi rapuh di dalam. Kalau bete, hobinya bikin konten joget-joget biar lupa masalah. Kayak es krim rainbow: cantik tapi gampang cair kalau panas.",
  "Sagittarius-ESTP": "Sagittarius-ESTP kayak petualang yang sok berani tapi aslinya baperan. Suka bilang YOLO, tapi pas ditinggal malah galau nonton drama. Keliatan cuek, tapi sebenernya overthinking juga. Suka bikin plan spontan yang berakhir berantakan. Ngomongnya sok pede, padahal kadang ngarang juga. Kayak kue lapis: keliatan keren, tapi dalemnya rapuh. Sok rebel tapi hatinya selembut kapas.",
  "Sagittarius-ESFJ": "Sagittarius-ESFJ kayak tukang pesta yang pengen semua happy, tapi lupa recharge diri sendiri. Suka ngurusin orang lain, tapi malah ngelupain kebutuhan diri. Keliatan rame, tapi pas di rumah diem sambil overthinking. Suka upload foto rame biar keliatan bahagia, padahal dalem hati pengen curhat panjang. Kayak kue ulang tahun: penuh hiasan tapi gampang hancur kalo dipotong dikit.",
  "Sagittarius-ESTJ": "Sagittarius-ESTJ kayak bos kecil yang pengen semuanya teratur, tapi suka panik kalo nggak sesuai rencana. Suka ngomong tegas dan sok yakin, padahal dalem hati bingung juga. Pengen keliatan kuat, tapi hatinya kayak bolu kukus: empuk dan gampang penyok. Keliatan garang, tapi pas ditegur malah drama kecil-kecilan. Ambisius banget, tapi kadang nggak konsisten juga.",

  "Aries-INTJ": "Aries-INTJ itu kayak general perang yang sok strategis, tapi pas plan A gagal langsung emosi dan lempar keyboard. Sok cool, padahal dalem hati udah pengen banting meja. Suka mikir jauh ke depan, tapi realitanya lupa pake celana pas rapat. Ambisius banget, tapi kadang lupa kontrol emosi. Gaya tegas, tapi kalo diserang dikit langsung baper kayak kena prank.",
  "Aries-INTP": "Aries-INTP tuh kayak hacker yang otaknya penuh ide liar tapi lupa password sendiri. Suka bikin teori ribet yang bikin orang pusing, tapi pas disuruh praktekin malah error. Ngomongnya kayak coding yang belum di-debug, bikin bingung. Semangatnya meledak-ledak, tapi suka males ngerjain detail kecil. Punya 1001 plan, tapi cuma 1 yang dikerjain, itu pun setengah jalan.",
  "Aries-INFJ": "Aries-INFJ kayak pemimpin diam-diam yang keliatannya bijak, tapi dalem hati udah pengen teriak. Suka mikirin orang lain tapi lupa diri sendiri, kayak superhero yang nggak mau ngaku lelah. Keliatan kalem, padahal sering overthinking sampe lupa makan. Suka bikin plan rahasia buat nolong orang, tapi pas gagal malah baper diem-diem. Hatimu kayak diary rahasia yang penuh coretan drama.",
  "Aries-INFP": "Aries-INFP kayak seniman yang galau setengah mati tapi nggak mau ngaku. Suka bilang mau bebas, tapi pas ditinggal malah baper seminggu. Mood swing-nya kayak rollercoaster tanpa sabuk pengaman. Suka bikin puisi galau yang cuma dibaca sendiri. Semangatnya meledak-ledak, tapi kalo dibilang lebay malah diem baper. Kayak kembang api di siang bolong: meledak tanpa aba-aba.",
  "Aries-ENTJ": "Aries-ENTJ kayak bos mafia yang keliatan garang tapi dalem hati pengen dipeluk. Suka nyuruh orang dengan gaya tegas, tapi pas nggak diturutin malah drama kecil-kecilan. Ambisinya gede, tapi kalo plan-nya gagal langsung manyun kayak anak kecil. Suka bilang 'gue ngerti' padahal bingung juga. Nggak mau keliatan lemah, tapi pas sendirian sering galau mikirin hidup.",
  "Aries-ENTP": "Aries-ENTP kayak stand-up comedian yang idenya nggak habis-habis tapi kadang nggak nyambung. Ngomongnya suka ngelantur, bikin orang bingung ini beneran atau bercanda. Suka bikin ide liar, tapi pas disuruh eksekusi malah ngilang. Energinya kayak kembang api, meledak-meledak tapi gampang redup. Sok santai, padahal dalem hati sering insecure. Kayak badut yang nangis abis show.",
  "Aries-ENFJ": "Aries-ENFJ kayak mama drama yang pengen semua orang bahagia, tapi lupa bikin dirinya sendiri happy. Suka jadi tempat curhat, tapi pas butuh curhat malah nggak ada yang ngerti. Gaya bicara heboh, tapi dalem hati kayak boneka porselen yang retak. Suka bikin rencana gede buat ngebantu semua orang, tapi akhirnya kecapekan sendiri. Keliatan kuat, padahal sering overthinking sampe nangis diem-diem.",
  "Aries-ENFP": "Aries-ENFP kayak petasan pasar malam: rame banget, heboh, tapi gampang meletup kalo ditegur. Suka ngomong 'gue fine' padahal hatinya udah kayak es krim meleleh. Mimpinya segede langit, tapi kadang lupa action. Suka bercanda biar nggak keliatan rapuh. Penuh energi, tapi pas ditinggal sendirian langsung bete. Mood-nya kayak playlist random: dari party ke galau dalam 3 detik.",
  "Aries-ISTJ": "Aries-ISTJ kayak alarm pagi yang ngotot bikin orang bangun tapi lupa matiin diri sendiri. Suka bikin aturan ketat, tapi pas sendiri malah dilanggar. Keliatannya disiplin, tapi dalem hati penuh drama. Suka ngomel kalo orang nggak beres, padahal dia juga suka lupa. Kayak kalkulator rusak: keliatan tegas, tapi error pas ditekan terlalu keras. Ngaku kuat, padahal hatinya selembut mochi.",
  "Aries-ISFJ": "Aries-ISFJ kayak bodyguard yang sok kuat tapi gampang baper. Suka ngurusin orang lain, tapi pas dia butuh bantuan malah nggak bilang. Keliatannya tenang, padahal hatinya kayak adonan donat: lembek dan gampang sobek. Suka diem-diem nangis sambil nonton drama Korea. Kalau marah, nggak meledak, cuma pasif-agresif kayak status WA. Pengen bikin semua happy, tapi akhirnya capek sendiri.",
  "Aries-ISFP": "Aries-ISFP kayak seniman jalanan yang keliatannya cool tapi galau. Suka bilang 'gue butuh healing', padahal masalahnya cuma lupa bawa charger. Mood-nya kayak lampu disco: ganti-ganti warna tiap menit. Suka bikin konten aesthetic, tapi hidupnya berantakan. Pengen bebas, tapi baper kalo nggak diperhatiin. Keliatannya chill, tapi dalem hati kayak marshmallow yang dicelupin cokelat panas.",
  "Aries-ISTP": "Aries-ISTP kayak ninja modern yang sok cool, tapi pas masalah muncul malah drama diem-diem. Suka ngilang dari keramaian terus balik kayak nggak ada apa-apa. Suka mikir logis, tapi pas kena masalah malah ngegas nggak jelas. Kayak robot yang suka error kalau baterainya low. Nggak mau keliatan rapuh, tapi pas sendirian malah baper. Maunya simple, tapi dramanya luar biasa.",
  "Aries-ESFP": "Aries-ESFP kayak bintang tiktok: heboh, seru, tapi kalo nggak ada yang nonton langsung galau. Suka bikin story joget biar keliatan happy, padahal dalem hati bete. Energinya kayak gula merah: manis tapi gampang cair. Punya banyak temen, tapi kadang ngerasa kosong. Suka drama kecil-kecilan biar diperhatiin. Kayak kue tart ulang tahun: cantik, rame, tapi gampang hancur kalo dipotong.",
  "Aries-ESTP": "Aries-ESTP kayak anak motor yang sok rebel tapi pas ditinggal gebetan langsung galau. Suka bilang YOLO, padahal hatinya selembut es krim vanilla. Punya gaya pede, tapi pas gagal malah drama diem-diem. Suka bikin plan dadakan, tapi pas chaos malah bingung. Kayak botol soda: dibuka dikit langsung muncrat. Sok kuat, tapi gampang mewek kalo ada yang nyentil hati.",
  "Aries-ESFJ": "Aries-ESFJ kayak MC kondangan: heboh, rame, tapi dalem hati sering mikir 'kok aku gini-gini aja?'. Suka ngurusin orang lain sampe lupa diri. Suka upload foto seru biar keliatan bahagia, padahal pas sepi malah overthinking. Pengen semua orang happy, tapi capek sendiri. Kayak es krim rainbow: cantik, rame, tapi gampang meleleh kalo panas.",
  "Aries-ESTJ": "Aries-ESTJ kayak komandan pasukan yang pengen semua orang ikut aturan, tapi dia sendiri suka ngelanggar. Gaya ngomongnya tegas, tapi kalo dikritik langsung diem sambil ngelus dada. Punya ambisi segede gunung, tapi pas rencana gagal malah drama. Sok tough, padahal hatinya kayak bantal bulu: empuk, gampang penyok, dan gampang baper. Pengen keliatan bossy, tapi pas sendirian malah galau.",

  "Libra-INTJ": "Libra-INTJ tuh kayak diplomat yang sok cool, tapi pas debat kalah malah ngambek diem-diem. Suka mikir balance, tapi realitanya malah galau milih mana yang lebih penting: estetika atau logika. Gaya elegan, tapi kadang lupa kalau dirinya juga manusia biasa yang bisa salah. Sering kelihatan tenang, padahal dalem hati overthinking kayak kalkulator rusak yang nggak bisa reset.",
  "Libra-INTP": "Libra-INTP kayak seniman yang pengen bikin karya masterpiece, tapi malah nyasar ke teori aneh yang bikin pusing. Suka ngelantur random, bikin orang bingung ini ngomongin filosofi atau cuma halu. Nggak suka konflik, tapi malah sering bikin ribet diri sendiri. Terlalu mikirin semua sudut pandang, jadinya malah stuck nggak jalan-jalan. Kayak burung hantu bingung liat matahari.",
  "Libra-INFJ": "Libra-INFJ kayak pahlawan diam-diam yang pengen semua damai, tapi dirinya malah stres sendiri. Sok wise, padahal galau cuma gara-gara orang lupa bales chat. Terlalu mikirin perasaan orang lain sampe lupa perasaan sendiri. Keliatan kalem, tapi pas sendirian nangis nonton drama Korea. Kayak bunga indah yang gampang rontok kalo kena angin dikit.",
  "Libra-INFP": "Libra-INFP kayak penyair yang hidupnya drama banget. Suka bikin puisi galau yang isinya bimbang antara dua pilihan. Keliatannya sweet, padahal dalem hati sering overthinking sampe nggak bisa tidur. Suka banget bikin vibe aesthetic, tapi realitanya kamarnya berantakan. Ngomongnya halus, tapi baperan parah. Mood swing-nya kayak cuaca tropis: nggak bisa diprediksi.",
  "Libra-ENTJ": "Libra-ENTJ kayak CEO yang pengen dunia adil, tapi pas plannya gagal langsung drama diem-diem. Suka bikin rules tapi lupa kalo dia juga sering ngelanggar. Terlihat bossy, padahal kadang cuma mau diperhatiin. Ngomongnya tegas, tapi dalem hati mikir 'aduh gue jahat banget nggak sih?'. Kayak atasan yang keliatan tegas, tapi sebenernya rapuh kayak kerupuk pas dilempar ke kuah.",
  "Libra-ENTP": "Libra-ENTP kayak komedian yang ngomongnya nyeleneh, bikin orang ngakak tapi kadang nggak nyambung. Suka debat biar keliatan keren, tapi pas dikalahin malah diem. Idem banget, tapi pas eksekusi lupa caranya. Suka bikin ide random, tapi kadang nggak jalan karena bingung sendiri. Kayak kucing lompat ke kardus: niatnya keren, endingnya gagal lucu.",
  "Libra-ENFJ": "Libra-ENFJ kayak MC arisan yang pengen semua happy, tapi lupa bikin dirinya sendiri seneng. Suka jadi tempat curhat, padahal butuh curhat juga. Keliatan rame dan seru, tapi pas malem overthinking sendirian sambil stalking IG gebetan. Penuh energi positif, tapi kadang capek sendiri. Kayak lilin: terangin orang lain, tapi diri sendiri meleleh pelan-pelan.",
  "Libra-ENFP": "Libra-ENFP kayak badut ulang tahun yang selalu heboh, tapi pas ditinggal temen langsung mellow. Suka bikin suasana seru, padahal hatinya lagi kosong kayak dompet tanggal tua. Mimpinya segede galaksi, tapi kadang lupa buat ngejar. Penuh ide kreatif, tapi pas eksekusi malah bingung. Kayak balon helium: terbang tinggi, tapi gampang meletus kalo kesenggol.",
  "Libra-ISTJ": "Libra-ISTJ kayak satpam mall yang pengen semua teratur, tapi pas ada masalah malah panik diem-diem. Keliatan kaku, tapi dalem hati kayak marshmallow. Suka bikin list yang rapi, tapi akhirnya malah lupa ngejalanin. Gaya formal, tapi hatinya drama banget. Sering nyimpen perasaan sampe akhirnya meledak kayak kompor gas bocor. Suka marah-marah kecil yang bikin gemes.",
  "Libra-ISFJ": "Libra-ISFJ kayak mama yang sayang banget sama anaknya, tapi lupa diri sendiri. Suka diem-diem sedih cuma karena orang nggak bilang makasih. Keliatan tenang dan baik, padahal hatinya kayak bolu kukus yang gampang pecah. Suka mikirin kebahagiaan orang lain, tapi lupa recharge diri. Kayak boneka Teddy Bear: disayang semua orang, tapi isinya sobek-sobek.",
  "Libra-ISFP": "Libra-ISFP kayak seniman IG aesthetic: keliatan keren, tapi dalemnya penuh galau. Suka bikin feed cantik, padahal realitanya lagi overthinking berat. Pengen bebas, tapi gampang baper. Suka bilang 'self-care' tapi malah nambahin stress sendiri. Kayak kue cantik yang keliatannya enak, padahal dalemnya kosong. Penuh gaya, tapi kadang nggak tau arah hidupnya.",
  "Libra-ISTP": "Libra-ISTP kayak teknisi yang sok cool tapi dalem hati gampang panik. Suka ngilang dari keramaian, terus muncul lagi kayak nggak ada apa-apa. Ngomongnya to the point, tapi pas masalah muncul malah diem nggak jelas. Gaya chill, tapi dalemnya drama. Kayak robot yang baterainya low, tiba-tiba ngehang. Pengen keliatan strong, tapi sebenernya fragile banget.",
  "Libra-ESFP": "Libra-ESFP kayak bintang panggung yang pengen semua perhatian, tapi pas sendiri malah mellow. Suka upload foto seru, padahal hatinya lagi kayak es krim meleleh. Heboh di luar, tapi gampang baper kalo nggak diperhatiin. Penuh energi, tapi cepet capek. Kayak petasan tahun baru: heboh banget, tapi cuma sebentar. Keliatan bahagia, tapi dalem hati drama queen.",
  "Libra-ESTP": "Libra-ESTP kayak bad boy yang keliatan rebel, tapi pas ditinggal gebetan langsung mellow. Suka bikin plan mendadak, tapi pas chaos malah bingung. Gaya percaya diri, tapi kalo gagal langsung bete diem-diem. Pengen keliatan tough, padahal hatinya selembut agar-agar. Kayak motor balap: kenceng di awal, tapi pas nyerempet masalah malah mogok.",
  "Libra-ESFJ": "Libra-ESFJ kayak event organizer yang pengen semua happy, tapi malah stress sendiri. Suka jadi penengah, padahal hatinya kayak sponge yang nyerap semua drama. Heboh di luar, tapi suka ngeluh dalem hati. Keliatan strong, tapi sebenernya gampang goyah. Kayak dekor pesta: cantik dan rame, tapi rapuh kalo nggak ada yang ngejaga.",
  "Libra-ESTJ": "Libra-ESTJ kayak boss yang suka nyuruh-nyuruh, tapi pas dikritik diem sambil mikir 'emang aku gitu banget ya?'. Gaya tegas, tapi hatinya kayak permen kapas: lembut dan gampang meleleh. Suka bikin peraturan sendiri, tapi kadang dilanggar. Terlihat kuat, padahal sering galau sendirian. Kayak lemari kaca: keliatan kokoh, tapi gampang retak kalo dipukul dikit.",

  "Virgo-INTJ": "Virgo-INTJ itu kayak profesor yang terlalu perfeksionis sampe lupa kalo hidup nggak bisa serapi spreadsheet Excel. Suka bikin plan yang super detail, tapi panik kalo ada hal kecil keluar jalur. Keliatan cool dan logis, padahal dalem hati sering mikir 'gue tuh sebenernya harusnya lebih perfect dari ini'. Sering bikin orang kagum, padahal cuma pura-pura tenang biar nggak kelihatan panik.",
  "Virgo-INTP": "Virgo-INTP tuh kayak ilmuwan yang stuck di lab penelitian teori absurd. Suka mikir sampe overthinking, tapi pas disuruh praktik malah zonk. Keliatan pintar, tapi kadang lupa makan karena terlalu fokus mikirin 'kenapa hidup nggak bisa se-simple rumus matematika'. Suka bikin orang bingung, padahal dirinya juga sering bingung sama hidupnya sendiri. Terlalu banyak mikir sampe lupa hidup.",
  "Virgo-INFJ": "Virgo-INFJ kayak penulis novel misteri yang suka bikin plot twist rumit, padahal hidupnya sendiri penuh drama kecil yang nggak penting. Suka keliatan wise, tapi dalem hati gampang baper cuma karena temen lupa bilang terima kasih. Sering mikirin masalah orang lain, padahal masalah sendiri numpuk kayak cucian kotor. Gaya sok tenang, tapi dalem hati meledak kayak popcorn panas.",
  "Virgo-INFP": "Virgo-INFP tuh kayak seniman yang pengen dunia jadi lebih indah, tapi malah sering baper gara-gara ekspektasinya nggak sesuai realita. Suka bikin catatan aesthetic tapi sering lupa jalanin. Hatinya lembut kayak mochi, tapi rapuh kayak tisu basah. Sering overthink hal kecil, padahal orang lain nggak kepikiran. Kayak diary penuh curhat yang nggak pernah dikasih tau ke siapa-siapa.",
  "Virgo-ENTJ": "Virgo-ENTJ kayak CEO yang pengen semua berjalan lancar, tapi begitu ada masalah kecil langsung panik sambil ngomel. Keliatannya tegas dan perfeksionis, padahal dalem hati sering insecure takut keliatan gagal. Suka bikin aturan ketat, tapi diem-diem langgar aturannya sendiri. Gaya bossy yang bikin orang takut, tapi aslinya cuma pengen diakuin hebat biar bisa tidur nyenyak.",
  "Virgo-ENTP": "Virgo-ENTP kayak badut cerdas yang ngomongnya nyeleneh tapi nggak semua orang ngerti. Suka bikin ide besar, tapi pas eksekusi malah males. Gaya sok santai, tapi dalem hati sering panik kalo ada yang nggak sesuai rencana. Terlihat ceria dan seru, tapi kadang bikin chaos di sekitarnya gara-gara nggak mau nurut aturan. Kayak kembang api: heboh bentar, terus hilang nggak jelas.",
  "Virgo-ENFJ": "Virgo-ENFJ kayak mama yang pengen semua orang bahagia, tapi lupa kalau dirinya juga manusia biasa yang butuh istirahat. Suka jadi penolong tapi malah jadi korban drama. Keliatannya rapi dan perfect, tapi dalem hati sering insecure takut dibilang nggak cukup baik. Penuh perhatian, tapi kadang capek sendiri gara-gara ngurusin masalah orang lain. Kayak supir yang lupa ngerem.",
  "Virgo-ENFP": "Virgo-ENFP kayak kupu-kupu yang terbang kesana kemari, tapi pas disuruh fokus malah kabur. Suka heboh dan penuh ide seru, tapi sering lupa jalanin idenya. Dalem hati pengen rapi, tapi nggak bisa ninggalin sifat impulsifnya. Suka bilang 'gue pengen berubah' tapi endingnya gitu-gitu aja. Kayak kertas sticky note warna-warni: nempel di mana-mana, tapi gampang ilang juga.",
  "Virgo-ISTJ": "Virgo-ISTJ kayak komandan yang suka aturan banget, tapi begitu ada gangguan kecil langsung ngedumel. Terlihat disiplin dan teratur, tapi dalem hati suka kesel sendiri gara-gara hal sepele. Suka bikin plan rapi tapi panik kalo ada yang nggak sesuai. Keliatan kayak batu, tapi sebenernya hatinya selembut marshmallow. Suka ngomelin orang lain, tapi nggak sadar dirinya juga salah.",
  "Virgo-ISFJ": "Virgo-ISFJ kayak pengurus rumah yang pengen semuanya sempurna, tapi stress sendiri kalo nggak ada yang bantu. Suka nyimpen perasaan dan bilang 'gapapa', padahal dalem hati pengen teriak. Keliatan sabar, padahal hatinya kayak kaca yang gampang pecah. Sering terlalu mikirin detail sampe lupa istirahat. Kayak lilin kecil yang nyala terus, tapi akhirnya abis juga.",
  "Virgo-ISFP": "Virgo-ISFP kayak seniman yang pengen keliatan aesthetic, tapi malah stress gara-gara detail kecil yang nggak sempurna. Suka mikirin penampilan tapi lupa kesehatan. Mood-nya kayak lampu disko: kadang terang banget, kadang mati total. Pengen bebas, tapi dalem hati takut dibilang nggak kompeten. Suka bilang butuh healing, padahal masalahnya cuma lupa password.",
  "Virgo-ISTP": "Virgo-ISTP kayak montir yang sok cuek, tapi dalem hati gampang panik kalo ada masalah nggak sesuai ekspektasi. Suka bilang 'yaudah' tapi pas sendirian overthink sampe nggak bisa tidur. Keliatan santai, tapi sebenernya kayak bom waktu yang siap meledak. Suka main logika, tapi kalo gagal malah drama diem-diem. Kayak mesin canggih yang baterainya abis pas lagi butuh banget.",
  "Virgo-ESFP": "Virgo-ESFP kayak selebgram yang pengen keliatan fun, tapi sebenernya galau soal like dan comment. Suka heboh dan ceria, tapi dalem hati gampang down kalo nggak diperhatiin. Penuh gaya, tapi sering nggak konsisten sama yang diomongin. Suka bikin story rame, tapi pas bales chat malah slow respon. Kayak kembang api: heboh di awal, tapi ilangnya cepet banget.",
  "Virgo-ESTP": "Virgo-ESTP kayak pembalap yang pengen gaspol terus, tapi panik kalo ada rintangan kecil. Suka bikin keputusan mendadak tapi nggak mikir panjang. Terlihat pede dan berani, tapi sebenernya takut banget gagal. Pengen keliatan tough, tapi dalem hati kayak anak ayam nyasar. Suka sok rebel, tapi diem-diem pengen dipuji. Kayak mobil sport: keren di luar, tapi sering mogok.",
  "Virgo-ESFJ": "Virgo-ESFJ kayak wedding planner yang pengen semua perfect, tapi stress sendiri pas ada yang nggak sesuai. Suka ngurusin orang lain sampe lupa diri sendiri. Terlihat ramah, tapi kadang ngomelin orang pelan-pelan biar nggak keliatan galak. Penuh perhatian, tapi gampang capek. Kayak kue tart cantik: luarannya keren, tapi dalamnya rapuh. Sering kesel sendiri kalo ada yang nggak sesuai plan.",
  "Virgo-ESTJ": "Virgo-ESTJ kayak bos yang pengen semua berjalan sesuai rencana, tapi kalo ada yang miss kecil langsung panik sambil ngomel. Suka bikin aturan ketat, tapi kadang dilanggar sendiri. Terlihat keras dan tegas, tapi dalem hati sering mikir 'gue kok gini banget ya'. Keliatan bossy, tapi sebenernya cuma takut keliatan nggak kompeten. Kayak benteng kuat yang gampang retak kalo ditendang dikit.",

  "Leo-INTJ": "Leo-INTJ itu kayak raja yang pengen semua nurut, tapi dalem hati sering overthinking takut nggak dihargai. Keliatan cool dan berwibawa, tapi suka drama sendiri kalo nggak diperhatiin. Suka bikin plan besar, tapi gampang ngambek kalo nggak ada yang bilang hebat. Kayak singa di film kartun yang sok garang tapi dalem hati cuma pengen dipeluk.",
  "Leo-INTP": "Leo-INTP kayak penemu yang pengen keren, tapi sering lupa cara bikin idenya jadi nyata. Suka mikir teoritis dan keliatan pinter, tapi panik sendiri kalo diminta eksekusi. Terlihat santai dan cuek, padahal dalem hati pengen banget dapet pengakuan. Sering ngomong random yang bikin orang bingung. Kayak robot keren yang sistemnya suka error pas lagi butuh.",
  "Leo-INFJ": "Leo-INFJ kayak penulis skenario yang pengen jadi pahlawan, tapi terlalu mikirin drama kecil yang nggak penting. Suka keliatan kalem dan bijak, tapi dalem hati gampang baper kalo nggak dipuji. Terlalu mikirin semua orang sampe lupa diri sendiri. Gaya misterius yang bikin orang penasaran, padahal sebenernya cuma pengen dipuji cantik atau keren.",
  "Leo-INFP": "Leo-INFP kayak seniman yang pengen bikin masterpiece, tapi galau karena nggak semua orang ngerti. Hatinya lembut kayak boneka, tapi baper kalo nggak diperhatiin. Sering overthinking dan bikin puisi galau di notes HP yang nggak pernah dipublish. Sok santai, padahal dalem hati pengen banget jadi pusat perhatian. Kayak bintang jatuh yang pengen di-notice tapi nggak ada yang liat.",
  "Leo-ENTJ": "Leo-ENTJ kayak CEO yang gayanya bossy banget, tapi dalem hati rapuh takut nggak dihargai. Suka ngomong tegas dan keliatan hebat, tapi gampang kesel kalo orang lain nggak nurut. Ambisius dan pengen jadi nomor satu, tapi sering drama diem-diem kalo ada yang lebih menonjol. Kayak singa betina yang pengen ditakuti tapi aslinya gampang mellow.",
  "Leo-ENTP": "Leo-ENTP kayak badut yang pengen bikin semua ketawa, tapi dalem hati pengen banget dipuji pinter. Suka ngomong asal dan bikin lelucon receh, tapi gampang bete kalo nggak ada yang ngerespon. Kayak kembang api: heboh di luar, tapi mewek sendiri pas sepi. Sering bikin ide keren, tapi lupa jalaninnya. Kayak presenter yang heboh tapi lupa nulis script.",
  "Leo-ENFJ": "Leo-ENFJ kayak host acara TV yang pengen semua happy, tapi sering lupa kalo dirinya juga butuh diperhatiin. Suka jadi moodbooster tapi dalem hati pengen banget dipuji. Keliatannya ramah dan perhatian, tapi kadang kesel kalo nggak dapet apresiasi. Kayak penyanyi panggung yang senyum terus, tapi pulang-pulang nangis di belakang panggung.",
  "Leo-ENFP": "Leo-ENFP kayak kupu-kupu yang terbang heboh kesana-kemari, tapi gampang nangis kalo nggak dipuji. Suka bikin suasana seru, tapi baper kalo ada yang nggak sejalan. Sering bilang pengen jadi diri sendiri, tapi galau kalo nggak ada yang notice. Kayak bintang pop yang gayanya heboh, tapi dalem hati pengen peluk boneka biar nggak nangis.",
  "Leo-ISTJ": "Leo-ISTJ kayak komandan yang pengen semua teratur, tapi dalem hati pengen banget diakuin keren. Suka bikin plan rapi dan disiplin, tapi gampang ngambek kalo hasilnya nggak sesuai ekspektasi. Terlihat tegas dan kuat, tapi dalem hati kayak anak kecil yang pengen dibilang hebat. Suka marah-marah kecil, tapi sebenernya cuma pengen dapet perhatian.",
  "Leo-ISFJ": "Leo-ISFJ kayak ibu rumah tangga yang pengen semua seneng, tapi capek sendiri kalo nggak ada yang apresiasi. Suka jadi orang baik yang diem-diem sakit hati. Keliatannya sabar, tapi dalem hati drama banget kalo ada yang nggak ngerti maksudnya. Kayak boneka porselen: cantik di luar, rapuh di dalam. Suka bilang gapapa, padahal pengen banget dipuji.",
  "Leo-ISFP": "Leo-ISFP kayak seniman yang pengen karyanya dipuji, tapi malah insecure sendiri. Suka keliatan cuek tapi hatinya lembut kayak kapas. Sering bilang pengen healing, padahal masalahnya cuma nggak ada yang like di sosmed. Pengen bebas, tapi sensitif kalo diabaikan. Kayak kucing manja yang pengen dielus tapi pura-pura nggak mau.",
  "Leo-ISTP": "Leo-ISTP kayak ninja yang pengen keliatan cool, tapi panik kalo nggak diperhatiin. Suka keliatan tenang, tapi dalem hati pengen banget jadi pusat perhatian. Suka main logika, tapi drama diem-diem kalo ada yang nggak sesuai rencana. Kayak mobil sport yang keren tapi mesinnya sering rewel. Sering ngilang tiba-tiba, padahal cuma pengen dicariin.",
  "Leo-ESFP": "Leo-ESFP kayak selebgram yang hidupnya penuh filter, tapi panik kalo like turun. Suka heboh dan centil, tapi dalem hati pengen banget diakui. Penuh gaya, tapi kadang drama kalo nggak ada yang puji. Kayak bintang panggung yang sorot lampunya redup mendadak. Suka bilang santai, tapi aslinya gampang nangis kalo nggak diperhatiin.",
  "Leo-ESTP": "Leo-ESTP kayak bad boy/girl yang keliatan rebel, tapi gampang mellow kalo nggak dapet perhatian. Suka ngomong tegas dan berani, tapi dalem hati baper kalo ada yang kritik. Sering bikin keputusan dadakan, tapi panik kalo gagal. Kayak motor sport yang suka ngebut tapi bannya licin. Pengen keliatan tough, tapi sebenernya butuh dipuji biar pede.",
  "Leo-ESFJ": "Leo-ESFJ kayak wedding planner yang pengen semua perfect, tapi ngambek kalo ada yang nggak sesuai plan. Suka perhatian sama semua orang, tapi kesel sendiri kalo nggak ada yang bilang makasih. Keliatan ramah dan ceria, tapi drama banget kalo nggak dapet pujian. Kayak kue tart yang cantik di luar, tapi dalemnya rapuh dan gampang lumer.",
  "Leo-ESTJ": "Leo-ESTJ kayak bos yang pengen semua nurut, tapi gampang ngambek kalo nggak ada yang bilang keren. Suka ngomong tegas dan keliatan berani, tapi dalem hati takut banget kalo ada yang lebih hebat. Penuh aturan, tapi panik kalo gagal. Kayak singa yang keliatan garang, tapi sebenernya cuma pengen dielus sambil dibilang keren.",

  "Cancer-INTJ": "Cancer-INTJ itu kayak master planner yang dalem banget tapi baperan kayak anak kecil. Suka nyusun strategi buat jaga hati sendiri, tapi malah sering overthink sampe stuck di masa lalu. Terlihat dingin dan serius, tapi sebenernya gampang nangis kalo ditegur. Kalo marah, diam lama banget, kayak tenggelam di samudra rasa galau.",
  "Cancer-INTP": "Cancer-INTP itu kombinasi otak encer tapi hati super sensitif. Suka mikir ribet soal perasaan orang lain, tapi kaku kalo diajak ngobrol perasaan sendiri. Keliatan cuek, tapi dalem hati sering nangis karena salah paham. Kadang suka lupa makan karena terlalu asyik berantem sama pikiran sendiri, kayak badut sedih yang nggak mau ketahuan.",
  "Cancer-INFJ": "Cancer-INFJ kayak penyelam yang bawa hati super berat. Suka peduli banget sama orang lain sampai lupa jaga diri sendiri. Kadang suka baper berlebihan gara-gara hal kecil, tapi tetap sok misterius. Kalo lagi galau, bisa bikin novel air mata panjang banget. Selalu pengen jadi pahlawan, tapi malah sering terluka sendiri tanpa bilang siapa-siapa.",
  "Cancer-INFP": "Cancer-INFP itu seniman hati yang gampang baper. Setiap kata, lagu, atau film bisa bikin nangis bombay. Hidupnya kayak drama Korea yang nggak ada habisnya, penuh galau dan kenangan. Suka ngelamun soal masa lalu dan masa depan, tapi kadang nggak berani ambil langkah maju. Hatinya lembut banget, kayak kapas basah yang gampang robek.",
  "Cancer-ENTJ": "Cancer-ENTJ kayak bos yang pengen segala hal berjalan sempurna, tapi gampang rapuh kalau ditegur. Suka ngomong tegas dan ngatur orang, tapi dalam hati sering galau dan takut sendiri. Kalo dikritik, bisa diam lama dan ngambek kayak anak kecil. Ambisinya besar, tapi hati juga tipis kayak kue lapis yang gampang hancur kalau dipencet.",
  "Cancer-ENTP": "Cancer-ENTP itu kayak badut panggung yang suka bikin orang ketawa, tapi gampang baper pas sendirian. Suka debat dan sok tahu, tapi dalam hati penuh keraguan. Gampang bingung antara pengen bebas dan pengen dicintai. Kalau lagi down, suka nyari perhatian lewat jokes receh yang kadang nggak nyambung sama yang denger.",
  "Cancer-ENFJ": "Cancer-ENFJ itu caretaker sejati yang pengen semua orang bahagia, tapi kadang lupa jaga dirinya sendiri. Suka nyimpen perasaan sedih dan kecewa biar nggak ganggu orang lain. Kalau nggak dapet apresiasi, bisa lama mikir sampai baper berat. Keliatan kuat, tapi dalem hati kayak ombak yang mudah pecah kalau tersentuh sedikit saja.",
  "Cancer-ENFP": "Cancer-ENFP itu social butterfly yang gampang baper dan gampang galau. Suka heboh di luar, tapi dalem hati sering insecure dan takut ditinggal. Punya mimpi besar tapi kadang bingung mau mulai dari mana. Kalau nggak diperhatiin, suka ngambek dan bilang 'aku baik-baik saja' padahal hatinya kayak ombak yang terus naik turun.",
  "Cancer-ISTJ": "Cancer-ISTJ itu perfeksionis yang pengen semua rapi dan teratur, tapi hati gampang baper dan galau. Suka nyusun jadwal dan plan, tapi kalau ada yang nggak sesuai, langsung mood down. Kaku dan serius, tapi dalem hati pengen dipeluk dan dibilang hebat. Kadang marahnya diam-diam dan lama banget ngelupain sakit hati.",
  "Cancer-ISFJ": "Cancer-ISFJ itu tipe penyayang yang rela ngalah biar orang lain senang, tapi dalem hati penuh beban dan galau. Suka diem-diem nahan sakit dan nangis waktu sendiri. Keliatan tenang dan sabar, tapi kalau dikhianati bisa jadi drama queen yang sulit dilupain. Sering bilang 'gapapa', padahal hatinya hancur berkeping-keping.",
  "Cancer-ISFP": "Cancer-ISFP itu seniman hati yang lembut dan gampang baper. Suka cari ketenangan tapi sering kebawa perasaan. Mood-nya kayak cuaca, kadang cerah, kadang badai. Pengen bebas tapi takut sendiri. Suka bilang pengen healing, tapi sering malas ngapa-ngapain. Hatinya rapuh, gampang nangis, tapi sok cuek biar nggak dikasihani.",
  "Cancer-ISTP": "Cancer-ISTP itu kayak ninja yang pengen kelihatan cool dan santai, tapi dalam hati galau luar biasa. Suka ngilang pas lagi baper, tapi suka balik dengan sikap dingin. Logikanya kuat, tapi perasaannya dalam kayak samudra yang nggak kelihatan. Kadang suka bikin drama kecil sendiri tapi pura-pura nggak peduli.",
  "Cancer-ESFP": "Cancer-ESFP itu jiwa pesta yang suka heboh, tapi gampang galau kalo sendirian. Suka bikin orang senang, tapi dalem hati pengen dicintai dan diperhatiin. Kalau lagi sedih, suka upload story lagu galau biar orang tahu. Hidupnya kayak rollercoaster perasaan yang naik turun terus, kadang ceria, kadang mellow parah.",
  "Cancer-ESTP": "Cancer-ESTP itu petualang yang pengen bebas tapi takut ditinggal. Suka jadi pusat perhatian dan bikin suasana hidup, tapi dalem hati gampang baper dan insecure. Sok tegas dan pemberani, tapi kalau disakitin langsung mellow dan ngambek. Kayak singa yang suka teriak tapi sebenarnya takut sendiri di balik suara kerasnya.",
  "Cancer-ESFJ": "Cancer-ESFJ itu caretaker yang perhatian banget sama orang lain, tapi kadang lupa diri sendiri. Suka ngalah dan ngurusin semua orang, tapi kalau nggak dihargai bisa sedih lama. Keliatan ceria dan ramah, tapi dalem hati suka ngambek dan nangis diam-diam. Suka bikin orang lain senang tapi kadang dilema sendiri soal perasaannya.",
  "Cancer-ESTJ": "Cancer-ESTJ itu bos yang pengen semua berjalan lancar, tapi gampang baper kalau dikritik. Suka ngatur dan disiplin, tapi kalo ada masalah suka drama diem-diem. Terlihat tegas dan kuat, tapi dalem hati pengen dipuji dan dihargai. Kalau gagal, mood langsung anjlok kayak kena rem blong di jalan menanjak.",

  "Gemini-INTJ": "Gemini-INTJ itu kayak otak dua sekaligus: satu mikir jauh ke depan, satu lagi bingung sama mood sendiri. Suka bikin rencana super rumit tapi kadang lupa jalannya. Keliatan cool dan terorganisir, tapi dalam hati sering debat sama diri sendiri sampai bingung mau gimana. Sering sok pinter tapi ternyata cuma ngarang cerita.",
  "Gemini-INTP": "Gemini-INTP itu tipe pemikir yang nggak pernah puas. Otaknya kayak loading terus, ide numpuk tapi susah fokus. Suka banget debat dan mikir hal-hal abstrak, tapi pas disuruh action malah bingung sendiri. Kadang ngomong random kayak robot error, bikin orang lain garuk-garuk kepala tapi dia seneng aja.",
  "Gemini-INFJ": "Gemini-INFJ itu kombinasi unik: pengen dekat sama orang tapi takut kedekatan baperan. Suka banget mikirin masa depan dan rahasia orang lain, tapi suka lupa jaga perasaan sendiri. Kadang sok misterius tapi suka bocorin rahasia sendiri tanpa sadar. Galau dalem banget tapi nutupin pake senyum manis.",
  "Gemini-INFP": "Gemini-INFP itu tukang ngelamun yang ga konsisten. Suka banget nulis dan curhat, tapi seringnya malah batal atau lupa. Hatinya lembut, tapi gampang berubah-ubah kayak cuaca. Suka mikir tentang cinta dan mimpi, tapi kadang bingung harus mulai dari mana. Sok puitis tapi kadang suka nyeleneh sendiri.",
  "Gemini-ENTJ": "Gemini-ENTJ itu bos yang pengen semuanya jalan cepet, tapi suka nggak sabaran sama yang lambat. Suka ngomong cepat dan tegas, tapi kadang ide-idenya nggak jelas karena otaknya loncat-loncat. Kadang sok dominan tapi dalam hati ragu sendiri. Kalau dikritik, bisa langsung ngegas atau malah diem gak jelas.",
  "Gemini-ENTP": "Gemini-ENTP itu raja debat yang nggak pernah capek. Suka bikin jokes nyeleneh, tapi kadang keterlaluan sampe bikin orang bingung serius atau bercanda. Otaknya cepat banget, gampang bosan sama hal yang itu-itu aja. Suka sok eksentrik tapi sebenernya pengen banget diperhatiin dan dimengerti.",
  "Gemini-ENFJ": "Gemini-ENFJ itu social butterfly yang pengen semua orang happy, tapi kadang kelamaan mikirin apa kata orang. Suka banget ngatur orang lain, tapi kadang lupa jaga perasaan sendiri. Kadang galau dalem, tapi sok hepi dan ceria supaya orang lain gak curiga. Pinter ngomong tapi suka bingung sama perasaan sendiri.",
  "Gemini-ENFP": "Gemini-ENFP itu tukang heboh yang susah diem. Punya ide gila dan mimpi besar, tapi seringnya malah lupa buat jalanin. Suka banget ngobrol dan kasih perhatian, tapi kadang gampang baper dan ngambek tiba-tiba. Kalo lagi down, suka ngomong ‘aku baik-baik aja’ padahal hatinya ribut kayak pasar malam.",
  "Gemini-ISTJ": "Gemini-ISTJ itu orang yang pengen rapi dan teratur, tapi Gemini-nya bikin mood jadi naik turun kayak rollercoaster. Suka bikin jadwal tapi sering telat sendiri. Kaku dan serius di luar, tapi dalem hati pengen dipeluk dan dimengerti. Kadang bingung antara disiplin dan pengen santai, jadi hasilnya suka bikin bingung orang sekitar.",
  "Gemini-ISFJ": "Gemini-ISFJ itu tipe yang pengen jadi pelindung orang lain, tapi sering overthinking soal perasaan sendiri. Suka diem-diem nyimpen beban, padahal keliatan ceria. Kadang suka kebawa perasaan kecil jadi galau berkepanjangan. Suka bilang ‘gapapa’, tapi dalam hati kayak ribut sendiri kayak pasar malam yang gak pernah tutup.",
  "Gemini-ISFP": "Gemini-ISFP itu seniman hati yang suka bebas tapi gampang baper. Suka ngelamun dan bikin aesthetic, tapi mood-nya kayak sinar matahari yang kadang mendung. Pengen jadi keren dan beda, tapi kadang malah bingung sendiri sama perasaannya. Suka bilang pengen healing tapi malas gerak, jadinya stuck di tempat yang sama.",
  "Gemini-ISTP": "Gemini-ISTP itu tipe yang pengen kelihatan cool dan santai, tapi dalam hati gampang baper. Suka ngilang kalau lagi galau, tapi balik lagi dengan sikap dingin. Logikanya kuat, tapi suka bingung sama perasaan sendiri. Kadang bikin drama kecil sendiri tapi pura-pura nggak peduli supaya keliatan keren.",
  "Gemini-ESFP": "Gemini-ESFP itu tukang pesta yang gak bisa diem. Suka heboh dan jadi pusat perhatian, tapi dalem hati gampang galau dan insecure. Suka bikin orang ketawa, tapi kalau lagi sedih suka diem dan nangis diam-diam. Hidupnya kayak panggung drama yang selalu ada plot twist dan kejutan nggak terduga.",
  "Gemini-ESTP": "Gemini-ESTP itu petualang yang suka tantangan, tapi gampang baper kalo nggak dipuji. Sok tegas dan pemberani, tapi dalem hati sering bingung dan galau. Suka bikin keputusan cepat, tapi kadang nyesel sendiri. Kayak singa yang suka teriak, tapi sebenarnya takut sendiri di balik suara kerasnya.",
  "Gemini-ESFJ": "Gemini-ESFJ itu tukang ngurus yang pengen semua orang senang, tapi kadang lupa jaga perasaan sendiri. Suka banget perhatian sama orang lain, tapi kalau nggak dihargai bisa baper berat. Keliatan ceria dan ramah, tapi dalem hati suka ngambek dan nangis diam-diam. Suka bikin orang lain senang tapi kadang dilema sendiri soal perasaannya.",
  "Gemini-ESTJ": "Gemini-ESTJ itu bos yang pengen semuanya rapi dan berjalan lancar, tapi gampang baper kalau dikritik. Suka ngatur dan disiplin, tapi kalau ada masalah suka drama diem-diam. Terlihat tegas dan kuat, tapi dalem hati pengen dipuji dan dihargai. Kalau gagal, mood langsung anjlok kayak kena rem blong di jalan menanjak.",

  "Taurus-INTJ": "Taurus-INTJ itu tipe yang pelan tapi pasti, kayak kura-kura yang nyusun strategi sampe detail banget. Tapi kadang malah kebanyakan mikir sampe stuck gak jalan-jalan. Sok kalem dan penuh perhitungan, tapi sebenernya gampang kesel kalau ada yang ganggu rutinitasnya. Suka ngambek lama, tapi pas lagi mood bagus bisa jadi planner terbaik.",
  "Taurus-INTP": "Taurus-INTP itu pemikir yang nyantai tapi dalem banget. Suka ngulik ide tapi malas bergerak. Kadang kelihatan cuek banget sampai orang kira gak peduli, padahal otaknya sibuk menganalisa segalanya. Gak suka buru-buru, tapi kadang kebanyakan mikir malah bikin bingung sendiri. Sok santai tapi sebenarnya keras kepala banget.",
  "Taurus-INFJ": "Taurus-INFJ itu tipe yang pendiam tapi perhatian banget. Suka nyimpen perasaan dalam-dalam, tapi kalau udah kesel bisa ngambek lama kayak batu nempel. Punya hati lembut tapi susah banget percaya sama orang baru. Kadang sok misterius, tapi sebenernya pengen deket dan dicintai dengan tulus. Setia banget, tapi kalau dikhianati bisa jadi dingin banget.",
  "Taurus-INFP": "Taurus-INFP itu pemimpi yang suka melamun sambil ngunyah cemilan. Hatinya lembut tapi kuat, suka banget sama hal-hal estetis dan nyaman. Kadang suka baper sama hal kecil, tapi males banget buat ganti suasana. Setia sama mimpi dan orang yang dicinta, tapi kalau ditekan malah ngambek dan susah diajak kompromi.",
  "Taurus-ENTJ": "Taurus-ENTJ itu boss yang gak mau buru-buru, tapi pasti menang. Suka ngatur dan rencanain semuanya dengan detail, tapi kalau ada yang ganggu mood bisa jadi sosok paling ngeselin. Sok tegas dan dingin, tapi sebenernya gampang baper kalo dikritik. Keras kepala banget, susah ngalah, tapi kalo udah yakin sama sesuatu, susah digoyahin.",
  "Taurus-ENTP": "Taurus-ENTP itu kombinasi unik: suka cari ide baru tapi kadang males gerak. Sok kreatif dan nyeleneh, tapi kalau lagi gak mood bisa jadi super malas. Suka debat dan pinter ngomong, tapi gampang baper kalo ada yang nyentil. Kadang kelihatan santai tapi hati-hati banget sama siapa yang dia percaya.",
  "Taurus-ENFJ": "Taurus-ENFJ itu penyayang yang pengen semua orang nyaman, tapi kadang terlalu keras sama diri sendiri. Suka ngurusin orang lain sampai lupa jaga mood sendiri. Kalau disakitin bisa ngambek lama dan sulit move on. Kuat dan setia, tapi kadang susah banget buat terima perubahan yang nggak sesuai keinginannya.",
  "Taurus-ENFP": "Taurus-ENFP itu campuran antara heboh dan santai. Suka senang-senang, tapi gampang ngambek kalau ada yang ganggu kenyamanan. Punya mimpi besar tapi kadang males jalaninnya. Suka ngasih perhatian, tapi kalo gak dibalas bisa baper dan ngambek diam-diam. Setia banget, tapi susah buat percaya orang baru.",
  "Taurus-ISTJ": "Taurus-ISTJ itu tipe yang rapi dan disiplin, tapi juga keras kepala kayak batu karang. Suka ngatur semuanya dengan detail, tapi kadang gak fleksibel sama sekali. Kalau ada yang ganggu rutinitas, mood langsung turun. Kaku di luar, tapi dalemnya pengen dimengerti dan dihargai. Susah banget buat berubah, tapi kalau udah yakin, gak bakal mundur.",
  "Taurus-ISFJ": "Taurus-ISFJ itu orang yang sabar dan setia banget, tapi kadang terlalu ngalah sampai capek sendiri. Suka nyimpen perasaan dan gak suka ribut, tapi kalau udah kesal bisa ngambek lama banget. Kuat tapi kadang susah buat bilang gak. Suka ngurusin orang lain, tapi lupa jaga diri sendiri sampai mood drop.",
  "Taurus-ISFP": "Taurus-ISFP itu seniman yang santai tapi penuh perasaan. Suka nyaman dan estetik, tapi kadang terlalu sensitif sama hal kecil. Pengen bebas tapi takut kehilangan kenyamanan. Mood-nya naik turun, kadang manis banget, kadang ngambek tanpa sebab. Suka healing dan nyari tempat aman buat diri sendiri.",
  "Taurus-ISTP": "Taurus-ISTP itu tipe yang cuek dan praktis, tapi juga keras kepala banget. Suka ngelakuin sesuatu dengan cara sendiri dan gak suka diganggu. Suka ngilang kalau lagi bete, tapi balik lagi kayak gak ada apa-apa. Sok cool, tapi dalem hati gampang baper. Kadang suka bikin drama kecil tapi gak mau ngaku.",
  "Taurus-ESFP": "Taurus-ESFP itu tukang seru-seruan yang pengen semua nyaman dan senang. Suka heboh tapi juga suka diem dan ngambek kalau gak dipahami. Kadang bikin orang bingung antara ceria atau galau. Punya hati yang besar tapi gampang baper sama hal kecil. Suka jadi pusat perhatian tapi juga pengen dimanja dan dicintai.",
  "Taurus-ESTP": "Taurus-ESTP itu tipe pemberani yang gak takut ambil risiko, tapi kadang terlalu keras kepala. Sok tegas dan suka tantangan, tapi kalau gak dapet apa yang dia mau bisa jadi ngambek berat. Gak suka diatur, tapi kalau dipuji bisa jadi manis. Kadang suka drama, tapi nutupin pake sikap dingin supaya tetep keren.",
  "Taurus-ESFJ": "Taurus-ESFJ itu tukang ngurus yang pengen semuanya berjalan lancar dan nyaman. Suka bantu orang lain tapi kadang lupa jaga diri sendiri. Kalau ada yang gak sesuai rencana bisa stres berat. Keras kepala dan susah kompromi, tapi setia banget sama orang yang dicintai. Suka ngambek diam-diam tapi susah buat minta maaf duluan.",
  "Taurus-ESTJ": "Taurus-ESTJ itu boss yang disiplin dan tegas, tapi gampang baper kalau dikritik. Suka ngatur dan pengen semua sesuai rencana, tapi kalau ada yang gak cocok bisa ngambek berat. Sok kuat tapi dalemnya pengen dipuji dan dihargai. Keras kepala dan gak suka berubah, tapi kalau udah yakin gak bakal mundur sedikit pun."
}
