  {
"Pisces-INTJ":"Pisces-INTJ itu kayak otak brilian yang nyasar di dunianya sendiri. Dia punya rencana besar dan visi jauh ke depan, tapi suka keteteran ngejalanin hal-hal simpel sehari-hari. Sering ngumpet di balik tembok dingin sok tenang, padahal otaknya ribet kayak detektif yang kebanyakan teori tanpa bukti. Sok rasional, tapi ujung-ujungnya baper juga.",
"Pisces-INTP":"Pisces-INTP itu otak paling nyeleneh dan random, suka overanalis tapi sering stuck di ide doang. Ngomongnya suka tiba-tiba lompat topik kayak lagu remix kacau. Overthinking tingkat dewa bikin dia kebanyakan mikir ‘what if’ sampe lupa kerjain tugas nyata. Pas disuruh action? Langsung freeze kayak laptop nge-hang.",
"Pisces-INFJ":"Pisces-INFJ itu master drama sejati. Bisa bikin konflik dalem kepala jadi lebih ribet dari sinetron. Sok misterius dan peka banget sama orang, tapi kadang kelewat baper sampai stres sendiri gara-gara salah chat atau kata-kata minor. Hatinya ibarat labirin rahasia, yang nyasar bisa susah keluar.",
"Pisces-INFP":"Pisces-INFP itu penyair galau yang setiap detik kayak adegan slow motion. Ngelamun dan kebawa perasaan sama hal-hal kecil sampai susah fokus. Suka bilang “aku beda,” tapi seringnya malah tenggelam dalam dunia imajinasi tanpa action nyata. Selalu sibuk bikin puisi tapi ujung-ujungnya cuma jadi draft yang nggak kelar-kelar.",
"Pisces-ENTJ":"Pisces-ENTJ itu bos tegas yang kadang lupa kalau dia juga manusia. Sok kuat dan penuh kontrol, tapi hati gampang pecah dan baperan kalau ada kritik pedas. Pengen jadi pemimpin keren tapi sering kelihatan overacting kayak drama queen di meeting. Kalau disindir, reaksinya meledak-ledak tapi diam-diam mikir “kenapa aku gak cukup baik?”",
"Pisces-ENTP":"Pisces-ENTP itu chaos incarnate, ide-ide liar tapi gak konsisten. Suka debat, ngerjain banyak hal sekaligus, tapi jarang ada yang selesai. Sok jago ngelawak tapi sering bikin bingung orang karena jokes-nya terlalu random. Pas sendirian? Galau berat soal makna hidup dan kenapa dirinya harus jadi Pisces yang baper.",
"Pisces-ENFJ":"Pisces-ENFJ itu penyelamat dunia yang sering lupa selamatin dirinya sendiri. Terlalu sibuk ngurusin orang lain sampai kelelahan dan burnout, tapi gak mau ngaku. Punya hati selembut kapas tapi pamer kuat. Kalau ada yang ngelarang bantuin, bisa galau berhari-hari, nulis puisi sedih yang cuma dia yang baca.",
"Pisces-ENFP":"Pisces-ENFP itu social butterfly yang penuh energi tapi dalemnya sering insecure banget. Suka cari perhatian dan bikin heboh, tapi gampang down kalau gak dapet respons yang diharapkan. Mimpi dan ide besar, tapi gampang ketipu sama diri sendiri. Sering bilang “aku baik-baik saja” padahal kayak es krim meleleh di terik matahari.",
"Pisces-ISTJ":"Pisces-ISTJ itu detail freak yang pengen semuanya rapi tapi otaknya Pisces bikin semuanya kacau. Bikin to-do list segunung, tapi ujungnya banyak yang nganggur. Sok disiplin tapi gampang kebawa perasaan kalau ada yang gak sesuai rencana. Kaku dan serius, tapi hati lembut yang cuma bisa dia sembunyiin dengan rapi.",
"Pisces-ISFJ":"Pisces-ISFJ itu pengabdi setia yang diam-diam nahan sakit hati supaya orang lain senang. Suka ngalah dan sering dimanfaatin, tapi jarang protes. Keliatan tenang dan sabar, tapi kalau terlalu banyak beban, bisa meledak tiba-tiba kayak bom waktu. Bilang “gapapa” tapi sebenarnya hati sedang hancur berantakan.",
"Pisces-ISFP":"Pisces-ISFP itu seniman hati yang hidupnya penuh warna dan drama kecil. Suka cari aesthetic tapi kadang mood swing-nya kayak rollercoaster tanpa rem. Ingin bebas tapi takut ditinggal, gampang baper kalau diabaikan. Sering bilang butuh healing tapi gak konsisten jalani prosesnya, malah ngulang pola lama terus.",
"Pisces-ISTP":"Pisces-ISTP itu si dingin dan misterius yang kelihatan cool banget, tapi gampang baper. Suka ngilang tanpa kabar, datang lagi kayak gak ada apa-apa. Pakai logika tajam buat orang lain tapi pas kena masalah sendiri langsung drama. Sok mandiri tapi dalam hati pengen dimanja dan dimengerti.",
"Pisces-ESFP":"Pisces-ESFP itu party animal yang hatinya sensitif kayak kapas. Seneng heboh dan rame, tapi kalau malem tiba-tiba galau mikirin mantan. Hidupnya kayak instastory penuh filter, tapi kalau ketemu langsung sunyi dan awkward. Suka drama sendiri lalu upload lagu galau yang bikin followers ikut bingung.",
"Pisces-ESTP":"Pisces-ESTP itu rebel yang pede dan berani, tapi galau banget kalau ditinggal gebetan. Sok tegas dan lantang ngomong, tapi sebenarnya bingung mau kemana hidupnya. Hobi ambil risiko, tapi pas susah langsung nangis diem-diem sambil nonton video lucu.",
"Pisces-ESFJ":"Pisces-ESFJ itu tukang ngurus yang selalu pengen semua orang senang, tapi sering dimanfaatin. Keliatan ceria dan ramah di luar, tapi di rumah sering nangis diam-diam. Punya hati besar tapi gak selalu bisa bilang “tidak.” Suka pamer hal-hal kecil, tapi ujung-ujungnya galau sendiri.",
"Pisces-ESTJ":"Pisces-ESTJ itu bossy dan tegas, tapi gampang baper. Ngomongnya tegas kayak komandan, tapi kalo dikritik langsung diem sambil mikir ‘emang aku seburuk itu ya?’. Suka mikir hidup tuh harus rapi, tapi pas gagal langsung drama seolah dunia kiamat.",
    
  "Aquarius-INTJ": "Aquarius-INTJ itu ilmuwan eksentrik yang otaknya selalu di awang-awang, jauh banget dari realita. Punya ide revolusioner, tapi sering lupa makan dan mandi karena terlalu sibuk mikirin masa depan. Sok dingin dan analitis, tapi ujung-ujungnya ngedumel sendiri karena rencana rumitnya gak jalan sesuai ekspektasi. Kayak alien yang tersesat di dunia manusia.",
  "Aquarius-INTP": "Aquarius-INTP itu kutu buku yang otaknya kayak labirin rumit penuh teori aneh. Suka debat sampai lawan ngomong kayak lawan robot, tapi pas disuruh keluar dari zona nyaman malah ngilang kayak hantu. Ide-idenya cemerlang tapi susah dieksekusi karena sibuk mikir kemungkinan terburuk. Ngomongnya random, kadang bikin bingung bahkan diri sendiri.",
  "Aquarius-INFJ": "Aquarius-INFJ itu jenius misterius yang suka overthink sampai stres. Dia pinter banget baca situasi tapi sering salah paham karena terlalu fokus ke kemungkinan aneh. Sok penyelamat dunia, tapi malah jadi makin bingung sendiri. Kalau galau, bisa bikin drama psikologis sampai bikin temen takut deket-deket. Hatinya kayak puzzle yang gak pernah kelar.",
  "Aquarius-INFP": "Aquarius-INFP itu pemimpi unik yang nyemplung di dunia fantasi terus lupa balik ke kenyataan. Punya hati lembut, tapi suka benci sama keramaian karena terlalu banyak stimulus. Suka nulis puisi dan lagu, tapi jarang ada yang ngerti karena terlalu abstrak. Kalau disuruh jelas-jelas, jawabannya malah ngambang kayak awan yang gak tentu arah.",
  "Aquarius-ENTJ": "Aquarius-ENTJ itu bos revolusioner yang selalu pengen rubah dunia, tapi kadang lupa aturan dasar sosial. Sok tegas dan penuh visi besar, tapi sering nabrak tembok karena gak sabaran. Suka ngatur orang lain, tapi kalau idenya gak diterima langsung uring-uringan kayak anak kecil gak dikasih mainan. Sok logis tapi dalemnya gampang baper.",
  "Aquarius-ENTP": "Aquarius-ENTP itu mastermind chaos yang selalu penuh ide liar dan debat tanpa henti. Suka bikin lelucon yang cuma dia yang ngerti, dan kadang bikin orang lain bingung. Punya energi tak terbatas, tapi susah fokus sampai sering ngelantur ke topik aneh. Sok pede dan kreatif, tapi sebenarnya suka galau soal makna hidup dan eksistensi diri.",
  "Aquarius-ENFJ": "Aquarius-ENFJ itu pemimpin karismatik yang pengen semua orang happy, tapi suka lupa ngurusin diri sendiri. Selalu jadi pusat perhatian dan penggerak komunitas, tapi kadang kelelahan karena gak bisa bilang 'tidak.' Suka mikirin masa depan orang lain, tapi masa depan sendiri suka keteteran. Kalau disinggung masalah pribadinya, langsung tutup mulut kayak pintu baja.",
  "Aquarius-ENFP": "Aquarius-ENFP itu social butterfly penuh ide brilian yang kadang kelewat random. Suka banget bikin rencana besar, tapi sering berubah pikiran dan susah konsisten. Sok ceria dan terbuka, tapi dalemnya suka insecure dan bingung mau jadi apa. Kalau dibilang serius, langsung ngeles kayak anak kecil yang ketahuan bohong.",
  "Aquarius-ISTJ": "Aquarius-ISTJ itu pengatur terorganisir yang mau semuanya sempurna, tapi otaknya Aquarius bikin dia kadang jadi alien di lingkungannya sendiri. Suka bikin aturan ketat, tapi sering bingung sendiri karena gak semua orang bisa ikutin standarnya. Sok disiplin tapi suka overthink hal kecil sampai ribet sendiri kayak robot yang error.",
  "Aquarius-ISFJ": "Aquarius-ISFJ itu pelindung yang penuh kasih sayang tapi sering merasa gak dihargai. Suka ngorbanin diri buat orang lain, tapi kadang kesel karena usaha kerasnya gak keliatan. Keliatan kalem, tapi dalemnya penuh konflik antara pengen bantu dan pengen dimengerti. Suka bilang 'aku baik-baik saja' tapi sebenernya pengen banget diperhatikan.",
  "Aquarius-ISFP": "Aquarius-ISFP itu seniman yang unik dan mandiri, tapi kadang suka bingung sama perasaannya sendiri. Punya vibe misterius dan suka menjauh kalau dunia terlalu ribet. Suka berekspresi lewat karya, tapi kadang mood swing bikin karya juga jadi nggak konsisten. Suka bilang 'aku bebas' tapi sering baper kalau dikritik soal karya seni.",
  "Aquarius-ISTP": "Aquarius-ISTP itu si problem solver yang cool dan logis, tapi kadang terlalu cuek sampe terkesan dingin. Suka ngilang pas masalah datang, kayak ninja modern yang menghindar. Sok mandiri tapi dalem hati pengen diperhatiin. Kalau ada drama, dia lebih milih kabur dari pada ribet, tapi di belakang layar sering mikir ribet sendiri.",
  "Aquarius-ESFP": "Aquarius-ESFP itu jiwa pesta yang enerjik dan penuh gaya, tapi hatinya gampang baper dan cemas. Suka jadi pusat perhatian dan bikin suasana heboh, tapi malamnya bisa galau mikirin masa depan yang gak pasti. Hidupnya kayak rollercoaster penuh warna, kadang ceria, kadang mellow tanpa alasan jelas. Suka drama tapi gak mau keliatan lemah.",
  "Aquarius-ESTP": "Aquarius-ESTP itu petualang tanpa batas yang suka ambil risiko dan hidup di saat ini, tapi gampang galau kalau gagal. Sok pede dan jago bikin keputusan cepat, tapi pas urusan perasaan langsung mumet dan bingung. Sok tegas dan berani, tapi sebenarnya sering bingung sama arah hidupnya sendiri. Kalau disuruh serius, sering melipir cari alasan.",
  "Aquarius-ESFJ": "Aquarius-ESFJ itu tukang ngurus yang peduli banget sama orang, tapi kadang terlalu ikut campur sampai capek sendiri. Suka bantuin tapi suka kesel kalau gak dihargai. Keliatan ceria dan ramah, tapi dalemnya sering merasa sepi dan gak dimengerti. Suka pamer kebaikan, tapi pas sendirian malah overthinking soal kenapa gak cukup baik.",
  "Aquarius-ESTJ": "Aquarius-ESTJ itu pemimpin keras kepala yang pengen segalanya berjalan sesuai rencana, tapi otaknya Aquarius bikin dia sering ngelantur jauh dari kenyataan. Sok tegas dan disiplin, tapi kalau ide-idenya ditolak langsung ngambek kayak anak kecil. Suka ngatur orang lain, tapi kadang lupa ngatur dirinya sendiri yang berantakan.",
    
{
  "Capricorn-INTJ": "Capricorn-INTJ itu seperti CEO yang lahir dari rahim spreadsheet. Mereka punya rencana hidup lima tahun ke depan, lengkap dengan backup plan dan analisis SWOT. Tapi saat disuruh bersosialisasi, ekspresinya kayak robot yang kehabisan baterai. Mereka bisa memimpin tim dengan efisien, tapi lupa bahwa manusia punya perasaan. Saking perfeksionisnya, mereka bisa stres sendiri kalau ada yang melenceng 0.01% dari rencana. Kayak main catur dengan diri sendiri, selalu mikir sepuluh langkah ke depan, tapi lupa nikmatin langkah yang sekarang.",
  "Capricorn-INTP": "Capricorn-INTP itu kombinasi antara profesor eksentrik dan akuntan yang terlalu serius. Mereka bisa menghabiskan waktu berjam-jam menganalisis teori yang bahkan belum ada, tapi lupa bayar tagihan listrik. Logika mereka tajam, tapi kadang terlalu rumit sampai orang lain bingung sendiri. Mereka suka debat, tapi lebih sering debat dengan diri sendiri di kepala. Kalau disuruh ambil keputusan cepat, mereka malah bikin diagram alur dulu. Saking mikirnya, mereka bisa lupa kalau hidup juga butuh dijalani, bukan cuma dianalisis.",
  "Capricorn-INFJ": "Capricorn-INFJ itu seperti penyair yang terjebak di tubuh manajer proyek. Mereka punya visi besar untuk menyelamatkan dunia, tapi terlalu sibuk menyusun to-do list harian. Mereka peduli banget sama orang lain, tapi sering lupa ngurus diri sendiri. Saking idealisnya, mereka bisa kecewa berat kalau realita nggak sesuai harapan. Mereka bisa jadi teman curhat terbaik, tapi pas giliran mereka curhat, malah milih nulis di jurnal rahasia. Kayak perpaduan antara hati yang lembut dan kepala yang penuh strategi.",
  "Capricorn-INFP": "Capricorn-INFP itu seniman yang mencoba hidup di dunia korporat. Mereka punya jiwa kreatif yang mendalam, tapi terjebak dalam rutinitas 9 to 5. Mereka bisa menulis puisi tentang laporan keuangan, dan menangis karena typo di email. Mereka ingin hidup sesuai nilai-nilai mereka, tapi sering merasa bersalah kalau nggak produktif. Saking idealisnya, mereka bisa stres sendiri kalau dunia nggak seindah imajinasi mereka. Mereka adalah bukti bahwa bahkan di dunia yang kaku, masih ada ruang untuk mimpi.",
  "Capricorn-ENTJ": "Capricorn-ENTJ itu pemimpin alami yang lahir dengan rencana lima tahun di tangan. Mereka bisa memimpin tim dengan efisien, tapi kadang lupa bahwa bawahannya juga manusia, bukan robot. Mereka ambisius sampai kadang nggak sadar udah melewati batas. Saking fokusnya pada tujuan, mereka bisa lupa menikmati proses. Mereka percaya bahwa istirahat itu untuk yang lemah, padahal tubuh mereka udah teriak minta libur. Tapi jangan salah, di balik sikap tegasnya, mereka juga punya sisi lembut yang jarang ditunjukkan.",
  "Capricorn-ENTP": "Capricorn-ENTP itu seperti pengacara yang juga stand-up comedian. Mereka bisa debat tentang topik serius sambil melempar lelucon sarkastik. Mereka punya ide-ide brilian, tapi sering loncat dari satu proyek ke proyek lain sebelum selesai. Mereka suka tantangan, tapi kadang terlalu banyak tantangan yang diambil sekaligus. Saking kreatifnya, mereka bisa bikin solusi untuk masalah yang belum ada. Tapi jangan harap mereka bisa duduk diam lama-lama, karena otaknya selalu bergerak 100 km/jam.",
  "Capricorn-ENFJ": "Capricorn-ENFJ itu mentor yang selalu siap membantu, tapi sering lupa bantu diri sendiri. Mereka peduli banget sama kesejahteraan orang lain, sampai kadang mengorbankan waktu dan energi pribadi. Mereka bisa jadi inspirasi bagi banyak orang, tapi di balik itu semua, mereka menyimpan beban yang nggak sedikit. Saking fokusnya pada orang lain, mereka bisa kehilangan arah hidup sendiri. Tapi dengan sedikit refleksi, mereka bisa menemukan kembali cahaya dalam diri mereka.",
  "Capricorn-ENFP": "Capricorn-ENFP itu seperti pelukis yang mencoba hidup sesuai jadwal ketat. Mereka penuh semangat dan ide-ide kreatif, tapi sering kewalahan dengan struktur dan aturan. Mereka ingin bebas berekspresi, tapi juga merasa bersalah kalau nggak produktif. Saking antusiasnya, mereka bisa mulai banyak proyek sekaligus, tapi jarang yang selesai. Mereka adalah bukti bahwa bahkan dalam dunia yang terstruktur, masih ada ruang untuk warna-warni imajinasi.",
  "Capricorn-ISTJ": "Capricorn-ISTJ itu seperti jam Swiss: presisi, andal, dan kadang terlalu kaku. Mereka punya standar tinggi dan nggak suka perubahan mendadak. Mereka bisa diandalkan dalam situasi apapun, tapi kadang terlalu fokus pada aturan sampai lupa fleksibilitas itu penting. Saking seriusnya, mereka bisa bikin suasana jadi tegang hanya dengan diam. Tapi di balik itu semua, mereka punya hati yang tulus dan niat baik untuk menjaga ketertiban.",
  "Capricorn-ISFJ": "Capricorn-ISFJ itu penjaga tradisi yang setia dan penuh kasih. Mereka selalu siap membantu orang lain, tapi sering mengabaikan kebutuhan sendiri. Mereka suka rutinitas dan kenyamanan, tapi kadang takut mencoba hal baru. Saking pedulinya, mereka bisa merasa bersalah kalau nggak bisa memenuhi harapan semua orang. Tapi dengan sedikit dorongan, mereka bisa menemukan keberanian untuk keluar dari zona nyaman.",
  "Capricorn-ISFP": "Capricorn-ISFP itu seniman yang tersembunyi di balik sikap pendiam. Mereka punya kepekaan estetika yang tinggi, tapi sering ragu mengekspresikan diri. Mereka menghargai keindahan dalam hal-hal sederhana, tapi kadang merasa dunia terlalu kasar untuk jiwa mereka yang lembut. Saking sensitifnya, mereka bisa terluka oleh kritik kecil. Tapi dengan dukungan yang tepat, mereka bisa bersinar dengan karya-karya indah mereka.",
  "Capricorn-ISTP": "Capricorn-ISTP itu teknisi handal yang lebih suka berbicara dengan alat daripada manusia. Mereka jago memecahkan masalah praktis, tapi kadang kesulitan mengekspresikan perasaan. Mereka suka tantangan dan petualangan, tapi juga menghargai waktu sendiri. Saking mandirinya, mereka bisa terlihat dingin atau acuh. Tapi di balik itu, mereka punya rasa ingin tahu yang besar dan semangat untuk belajar.",
  "Capricorn-ESFP": "Capricorn-ESFP itu bintang panggung yang juga punya rencana keuangan lima tahun ke depan. Mereka suka bersenang-senang dan jadi pusat perhatian, tapi juga mikir panjang tentang masa depan. Mereka bisa membuat suasana jadi hidup, tapi kadang terlalu fokus pada penampilan. Saking enerjiknya, mereka bisa kelelahan sendiri. Tapi dengan keseimbangan yang tepat, mereka bisa menikmati hidup sambil tetap bertanggung jawab.",
  "Capricorn-ESTP": "Capricorn-ESTP itu petualang yang juga punya spreadsheet untuk setiap perjalanan. Mereka suka tantangan dan aksi, tapi juga nggak lupa mencatat pengeluaran. Mereka bisa mengambil keputusan cepat, tapi kadang terlalu impulsif. Saking beraninya, mereka bisa terjebak dalam situasi berisiko. Tapi dengan sedikit perencanaan, mereka bisa menaklukkan dunia.",
  "Capricorn-ESFJ": "Capricorn-ESFJ itu ibu rumah tangga yang juga CEO keluarga. Mereka peduli banget sama kesejahteraan orang lain, tapi kadang lupa istirahat. Mereka suka menjaga tradisi dan keharmonisan, tapi juga bisa keras kepala. Saking sibuknya ngurusin orang lain, mereka bisa kehilangan waktu untuk diri sendiri. Tapi dengan sedikit me-time, mereka bisa kembali bersinar.",
  "Capricorn-ESTJ": "Capricorn-ESTJ itu bos yang lahir, bukan dibuat. Mereka suka mengatur dan memastikan semuanya berjalan sesuai rencana. Mereka tegas dan efisien, tapi kadang terlalu kaku. Saking fokusnya pada aturan, mereka bisa lupa fleksibilitas itu penting. Tapi dengan sedikit kelonggaran, mereka bisa jadi pemimpin yang dihormati dan disukai.",

  "Scorpio-INTJ": "Mastermind yang super intens, Scorpio-INTJ ini bukan orang biasa. Mereka nyimpen rahasia kayak superhero yang punya misi rahasia, tapi jangan harap kamu bisa tahu isi pikirannya. Mereka penuh strategi dan suka kontrol situasi, tapi dalem hati malah galau gak kelar karena gak semua bisa dia atur. Sok misterius, tapi sebenarnya takut ditolak.",
  "Scorpio-INTP": "Kombinasi ini kayak ilmuwan galau yang suka ngulik hal-hal berat dan nyeleneh. Scorpio yang emosional dikombinasi sama INTP yang suka logika bikin otak mereka kayak mesin rumit, kadang error karena kebanyakan mikir soal perasaan yang gak jelas. Mereka suka menghindar dan kayaknya dunia cuma milik mereka sendiri.",
  "Scorpio-INFJ": "Si penyendiri penuh drama batin. Scorpio-INFJ ini suka banget nyimpen semua beban hidup sendiri, sampai orang lain bingung dia baik-baik aja. Mereka peka, tapi susah dipercaya karena kadang sikapnya berubah drastis. Bisa tiba-tiba super perhatian, tapi bentar lagi ngilang kayak ninja.",
  "Scorpio-INFP": "Si romantis penuh rasa. Scorpio-INFP ini mudah baper dan sering melamun soal masa depan yang ideal banget. Mereka suka banget nyiksa diri sendiri dengan drama hati yang gak berujung dan kadang kayak main sandiwara sendirian. Tapi jangan salah, kalau marah mereka bisa jadi badai yang sulit ditebak.",
  "Scorpio-ENTJ": "Boss yang penuh ambisi dan drama. Scorpio-ENTJ ini tipe orang yang pengen menang terus, ngatur orang lain, tapi kadang overreact kalo dikritik sedikit. Mereka keras kepala dan penuh gairah, tapi gak jarang ngambek kayak anak kecil yang gak dapet permen.",
  "Scorpio-ENTP": "Si pembuat onar yang licik. Scorpio-ENTP ini suka bikin drama dan debat kusir. Mereka suka nyeleneh, ngaco, tapi punya otak tajam yang bisa bikin orang bingung apa serius atau bercanda. Suka banget bikin situasi makin ribet tapi di sisi lain gak bisa jauh dari keramaian.",
  "Scorpio-ENFJ": "Pemimpin karismatik yang suka banget ngatur orang. Scorpio-ENFJ ini punya aura intens dan perhatian sekaligus posesif. Mereka bisa jadi teman yang paling setia, tapi jangan coba-coba ngelanggar aturan mereka, bisa-bisa kamu jadi musuh seumur hidup.",
  "Scorpio-ENFP": "Si ekspresif yang gampang galau. Scorpio-ENFP ini kayak rollercoaster emosi; kadang semangat banget, bentar lagi nangis diam-diam. Mereka suka cari perhatian tapi juga takut terlalu dekat sama orang lain. Drama hidup mereka gak pernah habis dan selalu penuh kejutan.",
  "Scorpio-ISTJ": "Si batu karang yang susah ditembus. Scorpio-ISTJ ini kelihatan dingin dan kaku, tapi sebenarnya penuh perasaan yang gak pernah mereka tunjukin. Mereka disiplin dan keras kepala, gampang marah tapi susah banget nyerah. Kadang mereka kayak detektif yang mengintai tanpa orang tahu.",
  "Scorpio-ISFJ": "Si pelindung setia tapi penuh rahasia. Scorpio-ISFJ ini selalu siap jaga dan bantu, tapi punya sisi gelap yang jarang terungkap. Mereka gampang sakit hati tapi juga susah banget untuk memaafkan. Kadang diam-diam mereka menyimpan dendam yang dalam, tapi tetap rela berkorban demi orang terdekat.",
  "Scorpio-ISFP": "Seniman gelap yang emosional. Scorpio-ISFP ini punya jiwa seni yang tinggi tapi mood-nya kayak ombak laut, naik turun gak karuan. Mereka suka menyendiri tapi juga gampang baper kalau merasa diabaikan. Kalau lagi galau, mereka bisa bikin lagu sedih yang bikin kamu nangis juga.",
  "Scorpio-ISTP": "Si pemecah masalah dingin tapi mematikan. Scorpio-ISTP ini kayak ninja yang bisa diam-diam menyelesaikan masalah tanpa ribut. Mereka fokus, praktis, dan gak suka drama. Tapi jangan salah, kalau sudah marah bisa tiba-tiba meledak kayak gunung berapi.",
  "Scorpio-ESFP": "Si party animal yang emosional banget. Scorpio-ESFP ini bisa jadi pusat perhatian yang super intens. Mereka suka seru-seruan tapi juga gampang galau kalau hati mereka terluka. Kadang mereka kayak drama queen yang selalu bikin suasana jadi gak bisa tebak.",
  "Scorpio-ESTP": "Si petualang nekat yang penuh gairah. Scorpio-ESTP ini suka ambil risiko dan kadang bikin orang lain geleng-geleng kepala. Mereka sok berani tapi diam-diam suka galau juga kalau gagal. Suka konflik tapi juga cepat move on kalau udah gak sejalan.",
  "Scorpio-ESFJ": "Si pengurus penuh rasa yang gampang cemburu. Scorpio-ESFJ ini perhatian banget sama orang sekitar, tapi juga posesif dan suka overthinking. Mereka bisa jadi teman terbaik tapi juga bisa jadi musuh terberat kalau dikhianati.",
  "Scorpio-ESTJ": "Boss keras kepala dan penuh gairah. Scorpio-ESTJ ini tegas dan disiplin tapi gampang baper kalo dikritik. Mereka pengen segalanya berjalan sesuai rencana, tapi kalau gagal bisa jadi drama besar yang bikin semua orang ikut stress.",
    
  "Sagittarius-INTJ": "Sang perencana hidup yang pengen bebas tapi kadang malah ribet sendiri. Sagittarius-INTJ ini penuh ide liar tapi suka frustrasi karena dunia gak secepat otaknya. Mereka nyari kebenaran tapi sering bikin orang bingung dengan gaya sok pintar dan komentar nyeleneh. Otaknya gak pernah berhenti mikir, kadang bikin stres sendiri karena terlalu banyak rencana yang gak selesai.",
  "Sagittarius-INTP": "Si pemikir yang suka kabur dari drama. Sagittarius-INTP ini suka ngulik hal baru, tapi males aturan dan suka debat gak jelas. Mereka kayak petualang dalam kepala sendiri, yang sering gak ngerti perasaan orang lain karena terlalu fokus logika. Penuh dengan ide-ide kreatif tapi sering bingung mau mulai dari mana.",
  "Sagittarius-INFJ": "Si idealis yang pengen semua orang happy tapi suka lupa realita. Sagittarius-INFJ ini suka ngelamun soal masa depan cerah tapi kadang bingung sendiri jalan yang harus ditempuh. Mereka baik hati tapi suka galau sendirian karena ekspektasi yang kelewat tinggi. Kadang terlalu keras sama diri sendiri sampai lupa nikmatin hidup.",
  "Sagittarius-INFP": "Penyair bebas yang pengen hidup tanpa batas. Sagittarius-INFP ini gampang baper sama dunia dan suka ngelamun soal cinta dan petualangan. Kadang idealisnya bikin mereka susah nerima kenyataan, tapi mereka punya jiwa seni yang bikin semua terasa magis. Hatinya selalu mencari makna dan keindahan dalam hal-hal kecil.",
  "Sagittarius-ENTJ": "Pemimpin yang suka tantangan dan gak suka dikekang. Sagittarius-ENTJ ini penuh semangat tapi suka gak sabaran. Mereka pengen jadi yang terdepan tapi kadang suka ngawur dan ngasih deadline yang gak masuk akal buat orang lain. Ambisinya besar, tapi suka lupa ngejaga perasaan orang di sekitarnya.",
  "Sagittarius-ENTP": "Si pembuat onar yang suka tantangan baru. Sagittarius-ENTP ini suka debat dan cari ide-ide gila. Mereka gampang bosan tapi selalu bikin suasana hidup jadi seru, walau kadang bikin orang lain pusing karena gak konsisten. Mereka punya energi tanpa batas, tapi sering gak fokus pada satu hal.",
  "Sagittarius-ENFJ": "Si motivator yang penuh energi positif tapi kadang terlalu ngegas. Sagittarius-ENFJ ini suka banget bantu orang tapi kadang lupa diri sendiri. Mereka gampang baper soal hubungan dan suka drama kecil yang bikin hidup makin berwarna. Penuh semangat tapi kadang kelewat ngatur orang lain.",
  "Sagittarius-ENFP": "Si petualang sosial yang gak bisa diem. Sagittarius-ENFP ini penuh semangat, suka cari pengalaman baru, tapi gampang galau soal makna hidup. Mereka senang jadi pusat perhatian tapi kadang kebingungan sendiri dengan arah hidupnya. Hidup mereka kayak rollercoaster yang gak pernah berhenti, penuh kejutan dan cerita seru.",
  "Sagittarius-ISTJ": "Si disiplin yang suka aturan tapi pengen bebas. Sagittarius-ISTJ ini keras kepala dan kadang sulit adaptasi sama perubahan. Mereka kelihatan serius tapi kadang suka ngilang buat cari space sendiri. Mereka suka aturan tapi juga pengen hidup tanpa beban.",
  "Sagittarius-ISFJ": "Si penyayang yang setia tapi suka gak tegas. Sagittarius-ISFJ ini peduli banget sama orang lain tapi kadang bingung mau ngungkapin perasaan. Mereka suka jadi pendengar yang baik tapi susah ngomongin masalah sendiri. Kadang terlalu memikirkan orang lain sampai lupa diri sendiri.",
  "Sagittarius-ISFP": "Si seniman yang suka spontan. Sagittarius-ISFP ini pengen hidup tanpa batas tapi kadang gak konsisten. Mereka suka healing dan nyari inspirasi, tapi mood-nya gampang berubah dan suka baper sama hal kecil. Kreatif dan penuh warna, tapi juga gampang galau.",
  "Sagittarius-ISTP": "Si praktis yang suka tantangan. Sagittarius-ISTP ini gak suka drama dan suka cari solusi cepat. Mereka dingin tapi suka petualangan dan kadang sok cuek padahal dalemnya penuh rasa. Mereka problem solver yang handal tapi kadang susah ditebak.",
  "Sagittarius-ESFP": "Si pusat perhatian yang suka seru-seruan. Sagittarius-ESFP ini gampang bosen tapi penuh energi. Mereka senang ngobrol dan hangout, tapi kadang gak serius dan suka bikin masalah kecil. Mereka hidup untuk kesenangan tapi kadang lupa konsekuensi.",
  "Sagittarius-ESTP": "Si pemberani yang suka tantangan ekstrim. Sagittarius-ESTP ini spontan dan gak takut risiko, tapi kadang terlalu impulsif sampai bikin diri sendiri susah. Mereka suka cari perhatian dan bikin suasana jadi hidup. Mereka lincah, cepat mengambil keputusan, tapi sering nekat tanpa mikir panjang.",
  "Sagittarius-ESFJ": "Si pengurus sosial yang suka bantu tapi gampang baper. Sagittarius-ESFJ ini perhatian banget tapi suka overthinking soal hubungan. Mereka pengen semua orang happy tapi kadang lupa jaga perasaan sendiri. Mereka hangat dan ramah, tapi kadang terlalu ngatur orang."
}
